{
 "jobs": [
  {
   "Description": " Hi there, we're Athena Club! When it comes to women's health and body care, we've been given \"good enough\" for decades. But we're here to change that. We made it our mission to create the highest-quality products that address women's health from a 360-degree angle. We are growing very rapidly and are looking for someone with an entrepreneurial mindset who enjoys fast-paced environments.  \n   The Role:    Athena Club is looking for a Customer Experience Associate to join the team full-time. The Customer Experience Associate is responsible for addressing all customers and act as the voice of the company. The ideal candidate is someone with impeccable communication and organization skills. Previous experience in customer relations preferred, but not required.   \n   Responsibilities  \nRespond to all customer inquiries via email (using Zendesk) and social media (Facebook, Instagram) in a timely manner </li>\nListen, respond and help customers in a positive and kind way, acting as the voice of Athena Club</li>\nLog customer issues to identify ongoing trends to allow for continuous improvements in customer experience </li>\nCollaborate with other team members to provide feedback, resolve issues, and make improvements</li>\nResolve potential shipping issues with the help of our 3rd party partners</li></ul> \n   Requirements  \nExcellent written communication skills and strong attention to detail </li>\nAbility to thrive in a fast-paced environment </li>\nSelf-motivated and team-oriented </li>\nAbility to work 40 hours per week, including evenings and weekends </li>\nStrong sense of urgency and an ability to analyze and solve problems</li>\nBA or BS degree</li></ul> \n   The (+) Extras:  \n Medical insurance </li></ul></div>",
   "Title": "Customer Experience Associate",
   "Company": "Athena Club",
   "Location": "United States",
   "Posted time": "4 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Customer Service",
   "Employee type": "Full-time",
   "Industries": "Information Technology"
  },
  {
   "Description": "Partners Capital Investment Group is a global outsourced investment office seeking a talented Senior Associate to join our newly established West Coast team, located in San Francisco. The Senior Investment Associate will be a part of a diverse group that now requires an additional team player who will have wide-ranging, client-facing responsibilities.\n\nThis multi-faceted role requires someone who is comfortable in our entrepreneurial environment as we develop our business, combined with the analytical and creative strengths required to implement our investment strategy. Meticulous attention to detail, ability to think critically, and an execution-oriented, positive attitude are key attributes. Excellent written and verbal communication competencies are required for interacting with clients, third parties, and firm leadership.\n\nOur goal is that this person remains with the firm over the long-term to help the West Coast office achieve its ambitious goals. Our team puts a premium on transparency to maintain a meritocratic and collegiate environment. As a rapidly growing business, we seek team members with a strong work ethic and intellectual curiosity who will contribute as soon as they join us.\n\nAbove all, Partners Capital strives to best serve its clients with industry-leading investment performance and service; alongside the professional development and happiness of its employees.\n\n Client Portfolio Management (50%):  Creating investment strategy from inception to client presentation and execution; both virtually and in person. Managing clients’ balance sheets, preparing asset allocation analyses, and investment recommendations. This role requires a strong grasp of portfolio construction and an ability to produce client-ready work on tight deadlines.\n\n Business Development (40%):  Preparing pitch materials including evaluating existing portfolios, crafting Requests for Proposals, assisting with researching, identifying, and tracking prospective clients. Innovating new lines of business.\n\n Investment Research (10%):  Occasionally accountable for the investment due diligence process including sourcing and monitoring new investments and leading initial meetings in the research process. Responsible for conducting qualitative and quantitative analyses that require strong Excel modelling skills.\n\n <u>Qualifications\n\n</u> The ideal candidate will have 3-6 years of experience in asset management, investment banking, management consulting, or a related field. This person is expected to have an undergraduate degree from a top institution alongside a strong record of academic achievement. An MBA or CFA Charter is preferred, but not essential.\n\n <u>Compensation\n\n</u> Our salary and benefits package is competitive and includes a base salary, a performance-based cash bonus and a deferred compensation program directly linked to firm profitability, designed to support retention and incentivize long-term employees. Partners Capital is committed to the development of its staff and provides extensive on-the-job learning and training opportunities. We also support pursuit of professional certifications as appropriate to each individual.\n\n Partners Capital is diverse and inclusive, in people and in thought. Our meritocracy is enabled by fostering a truly inclusive and collaborative culture. We are proud to be an equal opportunity employer where diverse perspectives, backgrounds and experiences are valued. </div>",
   "Title": "Investment Associate",
   "Company": "Partners Capital",
   "Location": "San Francisco, CA",
   "Posted time": "1 week ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Finance",
   "Employee type": "Full-time",
   "Industries": "Sales"
  },
  {
   "Description": "  FULL-TIME EXPERIENCED PROOFREADER (ADVERTISING AGENCY)   \n  If you’re looking to join a team of talented creative professionals and amazing project managers who work to keep our clients happy every day,  thINK  may be the place for you.  thINK Communications  is a growing creative marketing boutique in Doylestown, PA with national brand clients—primarily in the financial services space.  \n  We’re looking for a full-time proofreader who: \nIs extremely detail oriented and highly organized</li>\nHas at least five years of professional experience as a proofreader</li>\nCan move quickly from one project to another and juggle multiple jobs at once</li>\nCan work within multiple style guides and adjust to client preferences and guidelines</li>\nIs willing to work collaboratively with other proofreaders, copywriters, and account managers</li>\nHas experience using Adobe Acrobat Reader comment tools and tracking edits in Microsoft Word</li></ul> \n   College degree and 5 years proofing experience required . Even better if that experience was at an advertising agency. And better yet, a background in the financial industry is a huge asset.  Other things you'll want to know: You can sign up for group health insurance (we pay some, you pay some) and enroll in our 401(k) plan with matching contributions and profit sharing after you're here one year. Oh, and there are complimentary snacks and drinks in the office to help keep your brain juices flowing.  \n  You’re welcome to split your working hours between our office with one of the best views in town (rooftop deck!) and your home. Please keep in mind though that this position may require in-person work 5 days a week in the future. We have not yet determined our post-pandemic plan. Therefore, you must live within a commutable distance to Doylestown, PA.   \n   If you’re interested, please email your resume to Katie@thinkcreates.com right away.  We're looking to get someone on board as soon as possible. </div>",
   "Title": "Proofreader",
   "Company": "Think Communications Group",
   "Location": "Doylestown, PA",
   "Posted time": "15 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Marketing",
   "Employee type": "Full-time",
   "Industries": "Public Relations"
  },
  {
   "Description": "We are hiring a Customer Service Representative to manage customer queries and complaints. You will also be asked to process orders, modifications, and escalate complaints across a number of communication channels. To do well in this role you need to be able to remain calm when customers are frustrated and have experience working with computers.\n\n <u>Customer Service Representative Responsibilities\n</u> <ul> \nMaintaining a positive, empathetic, and professional attitude toward customers at all times.</li> \nResponding promptly to customer inquiries.</li> \nCommunicating with customers through various channels.</li> \nAcknowledging and resolving customer complaints.</li> \nKnowing our products inside and out so that you can answer questions.</li> \nProcessing orders, forms, applications, and requests.</li> \nKeeping records of customer interactions, transactions, comments, and complaints.</li> \nCommunicating and coordinating with colleagues as necessary.</li> \nProviding feedback on the efficiency of the customer service process.</li> \nManaging a team of junior customer service representatives.</li> \nEnsure customer satisfaction and provide professional customer support.</li> </ul><ul> \nHigh school diploma, general education degree, or equivalent.</li> \nAbility to stay calm when customers are stressed or upset.</li> \nComfortable using computers.</li> \nExperience working with customer support.</li> \n\n</ul>PI</div>",
   "Title": "Customer Service Representative",
   "Company": "Hospitality WiFi LLC",
   "Location": "Columbus, OH",
   "Posted time": "48 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Associate",
   "Job function": "Customer Service",
   "Employee type": "Full-time",
   "Industries": "Information Technology"
  },
  {
   "Description": " A full-time, <u>bilingual</u> (Spanish-English) Research Assistant (RA) is sought for the Center for Behavioral Oncology at the Icahn School of Medicine at Mount Sinai. As a Research Assistant, you will be an integral member of our research team, and support the conduct of an NIH-funded randomized trial to investigate the effects of an information-sharing intervention on cardiovascular health in women undergoing mammography (PI: Dr. Guy H. Montgomery). You will work closely with the study investigators (including psychologists, breast radiologists, and cardiologists), study coordinator, and other research team members on patient recruitment, data collection, participant tracking, maintaining regulatory documents, and medical chart abstraction throughout the course of the study. You will be the primary patient contact for the study.  \n  The ideal candidate would be: 1) highly motivated and responsible; 2) an effective communicator; 3) warm, kind, friendly, and able to develop rapport with patients and medical staff quickly; 4) extremely organized and detail-oriented; 5) someone who combines initiative with responsiveness to supervision; 6) someone comfortable asking questions and eager to learn; 7) flexible and able to shift gears as new tasks present themselves; and, 8) comfortable in busy medical settings. Opportunities exist for mentorship and professional development for RAs preparing to apply for graduate school.  \n   Responsibilities and Duties :  1. Recruit women scheduled for mammography to the research study at the time of their appointment in the mammography clinic.  2. Contact study participants to administer surveys and collect relevant data.   3. Maintain accurate records of recruitment efforts and study data.  4. Abstract relevant study data from medical records.  5. Work cooperatively with other clinical and research staff members.  6. Be flexible; schedule may involve some early morning, evening, and/or weekend hours depending on patient availability.  \n   Minimum Requirements:   1.   Bachelor's degree in a relevant field (e.g., psychology, pre-med, other social science).  \n   Preferred Requirements :  1.   Previous experience recruiting women to research studies.  2.   Previous experience working on a clinical trial.  \n  The above list of responsibilities is intended to describe the general nature and level of work associated with the position; it is not intended to be an exhaustive list of job responsibilities.  \n  Applicants are encouraged to submit the following: a cover letter describing their interest in this position and why they think they would be a good fit, and a resume with sufficient detail to demonstrate their academic and relevant research or work experience. </div>",
   "Title": "Research Assistant",
   "Company": "Icahn School of Medicine at Mount Sinai",
   "Location": "New York, NY",
   "Posted time": "14 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Research",
   "Employee type": "Full-time",
   "Industries": "Analyst"
  },
  {
   "Description": "  Title:  Remote Recruiter - Part Time 25-30 hours/week   Start:  April 2021   Duration:  12+ months to start, could be long term engagement   Location:  Remote, Should be in the EST or CT time zone   Hours:  Flexible schedule, must be able to work during day time hours.   \n   Description:  \nWorking on finance roles, some technical and sales positions to name a few</li></ul> \n   Responsibilities:  \n3-5 years of hands on experience involved in the full life-cycle recruiting. Social media searching tools experience preferred.</li>\nHands on ATS experience required.</li>\nA can do attitude and commitment to providing excellent customer service to employees, candidates, business partners, and clients.</li>\nOversees the full life cycle of the recruiting process by screening resumes, interviewing candidates (by phone), administers appropriate assessments when required; works with hiring manager on making recommendations for hire (or not hire) and delivers employment offers for both exempt and nonexempt position openings.</li>\nUses traditional and nontraditional resources, such as college career fairs, talent pools and LinkedIn Recruiter etc., to identify and attract quality candidates.</li>\nSupport diversity &amp; inclusion initiatives along with internal mobility globally that are aligned with recruitment.</li>\nAbility to work autonomously and use resources available to complete tasks timely.</li>\nExperience managing change in a rapidly changing and a growing, culturally diverse environment.</li>\nExperience in supporting diversity &amp; inclusion initiatives along with internal mobility initiatives globally.</li>\nExperience with organizing internship programs and career fairs.</li>\nA demonstrated track record of managing and prioritizing multiple projects while meeting deadlines.</li>\nExcellent written and verbal communication and presentation skills.</li>\nStrong professional presence, ability to interact with various internal and external stakeholders and gain respect quickly.</li>\nDemonstrate ability to appropriately handle confidential information and sensitive situations in a reliable manner.</li></ul></div>",
   "Title": "Remote Recruiter - Part Time ",
   "Company": "Lorien",
   "Location": "United States",
   "Posted time": "37 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Mid-Senior level",
   "Job function": "Human Resources",
   "Employee type": "Part-time",
   "Industries": "Staffing and Recruiting"
  },
  {
   "Description": "Recruiting for a Purchasing Assistant to work on a contract basis. The responsibility of this position is to manage purchasing of digital services. Looking for someone who has an eye for detail and good at managing their own workload. Previous experience of purchasing would be very good. We offer opportunities for career progression for someone starting out within procurement.\n\nResponsibilities\n\nTo manage the inputting of prices, lead times and other data into the Company's Business Information System (SAP)\nTo manage the Purchase Requisition process - converting validated requisitions into Purchase Orders and distributing to relevant stakeholders\nTo ensure Purchase Orders include all relevant information in-line with Sourcing and Business requirements\nTo resolve issues relating to online Purchase Orders from internal Customers and external suppliers in a timely manner\nTo maintain an accurate 'base data' within the computer-based system\nTo ensure a timely resolution of Invoices Queries\nTo assist with purchasing cryptocurrencies.\nTo assist in the Request For Quote process, obtaining quotes and selecting Suppliers for requisitions\nObjective\nEnsuring all relevant contractual data/information is inputted and maintained within Company's Business Information System (SAP)\nManage the purchase of cryptocurrencies and order placement process for overhead orders\nEnsure Supplier communications/orderbooks and system data are correctly managed, and delivery commitments are met.</div>",
   "Title": "Virtual Assistant/ Purchasing",
   "Company": "Private Company",
   "Location": "United States",
   "Posted time": "40 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Not Applicable",
   "Job function": "",
   "Employee type": "Temporary",
   "Industries": "Marketing and Advertising"
  },
  {
   "Description": " Train to Become a Flight Attendant! \n \n Special 7 Day training in Orlando, Florida.</li>\n Classes held at JetBlue University with FAA certified instructors.</li>\n Trained on Full Motion Multi-Million Dollar Simulator.</li>\n Placement Assistance / Airline Interviews with an 86% hiring rate.</li>\n 67 Airlines have hired Airline Academy graduates.</li>\n A+ Rating with the Better Business Bureau.</li>\n Located at the Daytona Beach International Airport since 1994.</li>\n Scholarships and In-house Financing available.\n</li></ul> <u>Job Requirements\n\n</u>  Enrollment Requirements: \n\n Ø 19 years of age and older\n\nØ Speak, read, write, and understand English Fluently.\n\nØ No misdemeanors, DUI’s, or DWI’s within the past 10 years.\n\nØ No Felonies\n\nØ No tattoos on the face, neck, hands, or fingers.\n\nØ High School diploma or GED</div>",
   "Title": "Flight Attendant",
   "Company": "The Airline Academy",
   "Location": "Lakeland, FL",
   "Posted time": "42 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Management",
   "Employee type": "Full-time",
   "Industries": "Manufacturing"
  },
  {
   "Description": " Our client, in the investment banking industry, is looking for candidates to join their team in junior level financial and operational roles. The successful candidates will be analytical, able to interpret financial data and reports, and possess interpersonal skills to interact with external clients and senior level management.   Responsibilities:  \nSupporting the analysis of financial investment information</li>\nHandling high-volume, complex, and sensitive information</li>\nFacilitating key transactions within operations</li>\nReviewing and updating client accounts</li></ul>  Required Qualifications:  \nBachelor’s Degree in Finance, Economics, or related Business discipline</li>\nExcellent written and verbal communication skills</li>\nAbility to thrive in a fast-paced environment</li></ul>  Desired Qualifications:  \nProficiency in Microsoft Excel (pivot tables, VLOOKUP, formulas, etc.)</li>\nKnowledge of financial products (stocks, options, mutual funds, futures, etc.)</li>\n0-2 year(s) of work or internship experience</li></ul> \n   <u>Applicants must be local to the Baltimore area and are available for immediate hire.</u> If interested in starting or furthering your career in the investment banking industry, please apply!   \n   The Solomon Page Distinction    Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers – which sets us apart in the industries we serve.    About Solomon Page   Founded in 1990, with 14 offices and counting, Solomon Page is a specialty niche provider of staffing and executive search solutions across a wide array of functions and industries. The success of Solomon Page reflects an organic growth strategy supported by a highly entrepreneurial culture. Acting as a strategic partner to our clients and candidates, we focus on providing customized solutions and building long-term relationships based on trust, respect, and the consistent delivery of excellent results. For more information and additional opportunities, visit: solomonpage.com and connect with us on Facebook, Twitter, and LinkedIn.  \n  Opportunity Awaits. </div>",
   "Title": "Junior Investment Associate",
   "Company": "Solomon Page",
   "Location": "Baltimore, MD",
   "Posted time": "2 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Mid-Senior level",
   "Job function": "Accounting/Auditing",
   "Employee type": "Contract",
   "Industries": "Banking"
  },
  {
   "Description": " Medically Home (“MH”) is a fast-growing, technology-enabled company that was founded to make a major, positive difference in the way medical care is delivered. MH is leading this shift by providing the clinical intellectual property, technology platform, and coordination of acute rapid-response services that allow medical providers to safely shift advanced medical care from hospitals to patients’ homes. Through enabling its customer partners to create superior experiences and outcomes for patients, their families, and healthcare stakeholders, Medically Home is leading the charge in the innovation of healthcare delivery.      Job Description:        Medically Home is growing its customer teams focused on deploying the Virtual Hospital model through large-scale implementations followed by multi-year software and service contracts at health systems across the US. As the company establishes partnerships with providers on a national scale, Medically Home is seeking an Implementation Associate to provide go-live support for multiple implementations of the operational components of the Medically Home Virtual Hospital Model. Implementation projects involve partnering with customers from design and planning through go-live and stabilization of the Medically Home model and software platform. Implementation focus includes standing up virtual command center operations, establishing rapid response in-home service capabilities, configuring MH workflows, policies, and procedures to the customer setting, supporting MH software set-up, and facilitating training plans. The implementation associate will be eager, flexible, committed and customer-focused. Must be willing to do extensive traveling to client’s sites. They will ensure that new processes and software are implemented effectively, test the workflows and systems to ensure they meet customer needs, and support training.   Reports to: Implementation Manager   \n   Key Duties and Responsibilities:   The successful candidate will be a flexible team player, who can provide structure and organization while allowing for the unique needs of each implementation. This includes: \nLead 1-2 workstreams per customer implementation.</li>\nCreate and maintain a project timeline and plan.</li>\nExecute project plan segments, including design of workflows, sourcing of rapid response partners, training of clients and partners, and go-live support.</li>\nWith a firm understanding of the MH model, be able to present analysis and recommendations to internal teams and client.</li>\nProactively identify issues; troubleshoot and facilitate issue resolution.</li>\nManage upward by communicating progress and challenges, requesting guidance when needed, presenting potential solutions, and identifying next steps.</li>\nCommunicate effectively with different levels of internal and customer stakeholders regarding information needs. The associate will be responsible for leading broad work groups of customer stakeholders (clinical, operational, and technology) to inform the overall project key milestones.</li>\nLead trainings and workgroups for customer stakeholders and rapid response partners. Discuss and provide workflow solutions and ensure understanding of the virtual hospital workstreams through hands-on training.</li></ul> \n   ﻿Required Experience and Qualifications:  \nBachelor’s Degree</li>\n80-100% Travel (generally Monday – Thursday with the ability to fluctuate based on customer need and implementation cycle)</li>\n2+ years experience with integrating and interfacing major healthcare systems and services, including analysis, and gathering of customer requirements, product and training</li>\nMust be comfortable working in a fast-paced environment with multiple competing priorities</li>\nStrong written and verbal communication skills</li>\nGood organization skills and ability to multitask</li>\nGood problem solving and analytical skills</li>\nExceptional Customer Service skills</li>\nOutstanding communication skills: meaning you understand the significance and appropriate use of tone and mediums based on circumstance and audience</li>\nAdvanced Excel (VLOOKUP, pivot tables, formulas), Visio (or other workflow tool) and PowerPoint skills required</li></ul>      </div>",
   "Title": "Implementation Associate",
   "Company": "Medically Home",
   "Location": "United States",
   "Posted time": "30 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "",
   "Employee type": "Full-time",
   "Industries": "Hospital &amp; Health Care"
  },
  {
   "Description": " We are working with a prestigious downtown consulting firm that is seeking a contract to hire Remote Talent Acquisition Coordinator. The TA Coordinator will be responsible for scheduling and select operational/administrative initiatives with regards to Talent Acquisition. This individual will be the face of Talent Acquisition and front-line support of our Americas practice.   \n   Specific responsibilities include (but are not limited to):  \nOwnership of interview process management and execution across multiple regions within the Americas e.g. scheduling candidate interviews with appropriate teams.</li>\nMaintaining a best-in-class candidate experience, firmwide.</li>\nServe as main point of contact for all candidates and interviewers in New York office, from A/V set up to on-the-ground interview troubleshooting (when offices reopen)</li>\nWith travel agency partner, coordinate candidate travel and hotel bookings where needed (when offices reopen)</li>\nPartner with Executive Assistants and front desk teams to schedule candidates with senior leadership and ensure the day of interview experience reflects highly on the company's people forward values.</li>\nTrack all applicant activity in an accurate and efficient manner; provide reports as needed.</li>\nMaintain external and internal postings on company, school, and job board sites, removing or refreshing as applicable.</li>\nRoute incoming resumes and respond to general email and phone inquiries regarding open positions.</li>\nProvide additional recruiting-specific administrative support to the Talent Acquisition and People teams.</li>\nProactively follow-up with interviewers regarding feedback on candidates</li></ul> \n   An ideal candidate will have the following:  \nBachelor's Degree</li>\n1-2 years professional experience, particularly with calendar management/scheduling</li>\n1 year or more of HR/Staffing experience preferred, or related experience in an administrative role.</li>\nExcellent interpersonal and communication skills and strong attention to detail</li>\nAbility to remain calm in a fast-paced environment and prioritize competing requests.</li>\nDemonstrated ability to provide the highest level of customer service to internal and external customers.</li>\nBasic understanding of Recruiting and HR concepts, policies and procedures, and/or administrative procedures preferred.</li>\nProficient in MS Office Programs and Google Drive with the ability to learn additional programs as needed.</li>\nExperience with Applicant Tracking Systems a plus (Greenhouse)</li></ul> \n  Qualified candidates please send resumes to maggied@burnettspecialists.com.  </div>",
   "Title": "Talent Acquisition Coordinator",
   "Company": "Burnett Specialists",
   "Location": "Austin, Texas Metropolitan Area",
   "Posted time": "16 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Associate",
   "Job function": "Human Resources",
   "Employee type": "Full-time",
   "Industries": "Administrative"
  },
  {
   "Description": " The IQ Agency is hiring a remote a Social Content and Community Coordinator. We work to connect Gen Z with brands and provide our network of students with practical and entertaining advise to get them from college to career successfully.  \n  The successful candidate is dedicated, hardworking, organized and wants to provide great content to our Gen Z network. The position requires someone who can think big while managing the small details. Must have an understanding and passion for social media content and platforms.  \n  The following will be required for candidates:  Focus on growth and engagement for all IQ and CQ social channels and ensure weekly targets are hit.  Plan, create and analyze success of content on all IQ and CQ social channels (Instagram, YouTube, Tiktok, LinkedIn, blogs, Twitter and Facebook).  Find authentic ways to engage with our audience who will be lifelong advocates for the brand.  Create a sense of attachment through the relevant content we create and research new methods for growth across all channels.  Edit and approve all content and ensure it reflects our diverse network.  Coordinates IQ community events and initiatives   Support IQ marketing campaigns from a content perspective.  Build strategic relationships with organizations that cater to parents, career centers and professors.  \n  The ideal candidate has the following attributes:  Bachelor’s degree (B.A.) or equivalent  1-2 years related social media experience  Understanding of trends across social platforms  Excellent written and verbal communication skills  A strong work ethic and willingness to go above and beyond  Ability to adapt to changing priorities and business needs  Proven ability to manage tasks effectively while meeting deadlines and commitments  Highly organized and has excellent follow-through  Understanding of project management platforms  \n  \n  IQ Agency is an equal opportunity employer.  \n </div>",
   "Title": "Community and Content Social Coordinator",
   "Company": "Intern Queen Inc.",
   "Location": "Los Angeles, CA",
   "Posted time": "10 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Not Applicable",
   "Job function": "",
   "Employee type": "Full-time",
   "Industries": "Education Management"
  },
  {
   "Description": "Everglades University is an accredited, private not-for-profit university offering bachelor's and master's degree programs that prepare students to advance in their careers or fields of study. The mission of Everglades University is to provide quality education to adult learners of diverse backgrounds in a collaborative environment where each individual has the opportunity to achieve personal growth. The University seeks to accomplish its mission by combining small class sizes and innovative programs with traditional academic values. The University supports the academic endeavor through research, scholarly contribution, and service, to deliver graduate and undergraduate programs both on campus and online.\n\n <u>Description\n\n</u> Are you looking for a challenge and a career that helps change people's lives and also provides opportunity for growth and advancement? Then Everglades University is for you.\n\nEverglades University is seeking results-oriented, energetic Admissions Counselors who can work in a fast paced environment and who have effective decision making skills and customer service experience. Admissions Counselors assist prospective students by assessing their skills and interests and guiding them through the enrollment process. This position requires creativity, a high level of interpersonal communication skills, and strong computer and telephone skills.\n\n <u>Job Requirements\n\n</u> Admissions Counselors must have the minimum of a Bachelor's degree however a Master's degree is preferred. Qualified applicants must be flexible and adaptable to changing environments.\n\nThis is a full time position that may require working some nights and Saturdays.\n\nFor consideration, only online applications will be accepted. For further information, you may contact your local campus. Campus contact information listed on our website at www.evergladesuniversity.edu\n\nThank you for your interest in our school system. Our schools prohibit discrimination and harassment based on race, color, creed, religion, sex, gender, national origin, citizenship, ethnicity, marital status, age, disability, sexual orientation, gender identity and gender expression, genetic information, veteran status, or any other status protected by applicable law to the extent prohibited by law.</div>",
   "Title": "Admissions Counselor",
   "Company": "Everglades University",
   "Location": "Tampa, FL",
   "Posted time": "43 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Associate",
   "Job function": "Education",
   "Employee type": "Full-time",
   "Industries": "Training"
  },
  {
   "Description": "  Melaninaire PR  is a strategy-driven boutique public relations and brand strategy firm focused on supporting the vision and goals of disruptors of color in the film, fashion and lifestyle spaces to ensure that brands strategically connect to audiences where they have the greatest impact.  ______________________________________________________________________________   Melaninaire PR  is seeking one Public Relations Assistant to join our growing team.  Candidate must be strong writer, creative, go-getter, intuitive, agile, extremely articulate, and hardworking, with natural abilities and a deep passion for PR, marketing, branding, and social media. Qualified candidate will have a strong, successful track record of pitching media contacts via email and phone, and demonstrate the ability to diligently follow up.  Applicant should have at least 2 years of public relations experience with a B.A. degree in PR, Communications, Journalism or related degree. Candidate must be able to work quickly and efficiently under tight deadlines. These positions will include heavy writing and pitching. Candidates with strong media contacts preferred.  \n  We are looking to hire immediately.  \n   Position Status:    This position is a part time position and expected to be 20 hours a week. Schedule is flexible.    1 position open    \n   Compensation is offered in the form of a stipend:    Compensation is based on experience. This position does not offer benefits.  \n   Apply:      If this position sounds like something you’d excel at, please send a resume.    \n </div>",
   "Title": "Public Relations Assistant",
   "Company": "Melaninaire Public Relations",
   "Location": "Detroit Metropolitan Area",
   "Posted time": "34 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Marketing",
   "Employee type": "Contract",
   "Industries": "Public Relations"
  },
  {
   "Description": "  Who are we?   At Amdocs, our purpose is to enrich lives and progress society. With our creativity and technology, we help make a better connected world. Amdocs and its 25,000 employees serve the leading players in the communications and media industry, enabling next-generation experiences in 85 countries. Our cloud-native, open and dynamic portfolio of digital solutions, platforms and services brings greater choice, faster time to market and flexibility, to better meet the evolving needs of our customers as they drive growth, transform and take their business to the cloud. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.1 billion in fiscal 2019. For more information, visit Amdocs at http://www.amdocs.com  \n   <span class=\"ql-cursor\">﻿</span>In one sentence   Collaborate with cross-functional teams and develop business operation processes to achieve desired goals; Provide standard and ad-hoc analysis, reporting business related insights, improvement suggestions, and consultative services to unit's partners and other internal clients using business data; Support internal &amp; pivotal initiatives.  \n   What will your job look like?  \nResponsible for several cross unit processes and/or practices, or specializes and experienced in one of the mentioned domains ; May include resource management, performance and productivity management, customer satisfaction management, governance management, SLA management, on going budget/cost management.</li>\nProactively provide integrative view and analysis of the various business aspects across the unit/ project(s) to enable better decisions making. Create predictive routines and promotes risks mitigation.</li>\nIdentify &amp; highlight trends/ key issues and present results, pinpointing challenges, areas of concern and possible deviation from established plans in the domains under his responsibility; Propose action plans and mitigation activities and/ or opportunities for improvement; Compile information and results from different sources and develop reports, analysis, appropriate briefings as required; Work jointly with management to implement action plans.</li>\nResponsible for the execution of business improvement initiatives, internal/ strategic project; Perform audits/reviews, proactively identify challenges / opportunities and extract lessons-learned to achieve business goals.</li>\nWork to streamline work processes &amp; leverage best practices and standards across the unit/ projects.</li>\nInterface and work with business analysts and information system fps.</li>\nWork collaboratively and be serve as a trusted advisor to the unit's stakeholder's and other functions, providing essential business operational support/consultancy ensuring that the business and operations of the unit (i.e. Quality, Budget, Performance, Capacity etc.) are running on the specified cadence, adding value to unit's leadership discussions, operational discussions etc.</li></ul> \n   All you need is...  \nMinimum 4 years experience in program management/ planning &amp; control/ headquarter management</li></ul> \n   Why you will love this job:  \nBe a doer and trusted advisor across teams to ensure the business is achieving goals on a strategic level. Be a key member of a global, dynamic and highly interactive team with various possibilities for personal and professional development.</li>\nYou will have the opportunity to work in multinational environment for the global market leader in its field!</li>\nWe provide stellar benefits starting from health insurance, accidental insurance, and life insurance We also provide multiple leave benefits including paid, casual, sick, maternity, paternity, and even marriage leaves!</li>\nBuild an outstanding career path with us with industry leading internal mobility policies.</li></ul> \n   <u>Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce</u>                reasons to work for Amdocs  </div>",
   "Title": "Business Operations Professional",
   "Company": "Amdocs",
   "Location": "United States",
   "Posted time": "13 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Associate",
   "Job function": "Business Development",
   "Employee type": "Full-time",
   "Industries": "Information Technology"
  },
  {
   "Description": "  <u>Job Details: </u>       Job Title:  Marketing Associate II   Location:  Los Angeles once returning to office    Contract:  12 months with potential to extend       Duties:   ·       Support the Music Label Partnerships (MLP) team in various responsive/reactive categories:  ·       Rights Manager Support: Report/resolve bugs, Follow-up internally with ops/XFN teams to facilitate label responses  ·       Verification: Work with internal ops/concierge teams to process verification requests for all music label partners  ·       Whitelisting: Utilize internal tools to process verification requests for all music label partners. Manage database of requests  ·       User Account Management/Integrity: Reactive response to access issues/hacks, username/profile name changes, merge requests, etc.  ·       Ad Coupons: Create, manage and process ad credits/coupons for music label partners  ·       CRM: Work XFN to manage/maintain CRM database for music industry partners, create educational one-sheets on new product/features  ·       Reporting: From time-to-time, generate ad-hoc reports utilizing internal dashboards for MLP team and music label partners  ·       Payments: Maintain payment status workbook, process invoices, expedite payments, change in process requests/directives/etc.  ·       Meetings: From time-to-time, attend planning/execution meetings on above mentioned tasks.  ·       Artist/Campaign Tracking: Help track and share artist/label uses of music products on both platforms. Additional tracking may be required for larger multi-artist/label stunts.  ·       Best Practices Support: Occasional support creating one-sheets or bullets for partner best practice requests.        Skills   ·       2+ years digital music experience (interaction with record labels a plus but not required)  ·       Firm understanding of social media platforms and interaction with music  ·       Ability to meet multiple objectives in a fast-paced, highly iterative environment        Education   ·       Bachelor’s degree (preferred) </div>",
   "Title": "Marketing Associate",
   "Company": "US Tech Solutions",
   "Location": "Los Angeles, CA",
   "Posted time": "38 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Mid-Senior level",
   "Job function": "Marketing",
   "Employee type": "Contract",
   "Industries": "Sales"
  },
  {
   "Description": "  Are you a natural content creator with a passion for social media and video? Can you balance creativity with organization and attention to detail? We want to speak to you!   \n  <u>Gordon Law Group</u> is a leading tax and corporate law firm based in Northfield, Illinois (north Chicago suburbs). We are looking for a marketing associate to assist in the day-to-day operations of our content marketing strategy. Our content topics are technical and often complex.   The ideal candidate will be a creative thinker who can make this information approachable and engaging, as well as package it in various ways to reach the right audience across several digital channels. The ideal candidate will go beyond completing assigned tasks and bring new ideas to the table. Attention to detail and the ability to manage deadlines are critical to this role. We have a high standard for factual accuracy, grammar, and visual appeal. Candidates must be self-motivated to complete tasks on time and deliver excellent work.  \n   10-20 hours per week at $15/hour. You’ll have some flexibility to choose your days/hours as long as they’re consistent, but you must be able to work within the hours of 8 am – 6 pm M-F. Remote or in office.Candidates who want to work with us for at least 1 year strongly preferred.  \n  Responsibilities: \nTake ownership of the social media calendar (planning and posting). General content</li>\nthemes/guidance will be provided, but you should be able to source post ideas independently</li>\nBuild up our YouTube channel by transforming blog posts into informational videos that can also</li>\nbe repurposed for social media. </li>\nDrive traffic to our blog through engaging social media posts</li>\nBring creative ideas for scroll-stopping video ads</li>\nAssist with miscellaneous projects as needed, including blog writing, graphic design, research,</li>\nand reports.</li></ul> \n  What we’re looking for: \nSolid understanding of social media platforms including Facebook, Instagram, and Twitter. Must</li>\nunderstand what content is appealing on each channel and what gets ignored</li>\nExperience managing company social media accounts is a plus</li>\nExceptional grammar &amp;amp; writing skills—very few typos should escape your eagle eye</li>\nInitiative to study the best practices for various channels and apply what you learn</li>\nBasic video editing and graphic design skills (using tools such as Canva or Adobe Creative Suite)</li>\nFast learner who can quickly grasp our company’s voice and services using existing content and independent research</li>\nProven experience growing a new social media channel or increasing followers/engagement</li>\norganically is a big plus!</li>\nBasic understanding of cryptocurrency is helpful, but not required</li></ul> Please send resume and cover letter to gail@gordonlawltd.com </div>",
   "Title": "Marketing Associate",
   "Company": "Gordon Law Group, Ltd.",
   "Location": "Winnetka, IL",
   "Posted time": "8 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Marketing",
   "Employee type": "Part-time",
   "Industries": "Sales"
  },
  {
   "Description": "As a data entry operator, you will be required to compile, merge, and format documents for data entry, check documents for errors, input data and update the database, and manage the digital filing systems.\n\nTo be a successful data entry operator, you should possess excellent typing skills and be attentive to detail. Skilled data entry operators should be able to quickly identify data errors and demonstrate precision in their wor k.\n\n <u>Job Requirements\n</u> <ul> \nGathering, collating, and preparing documents, materials, and information for data entry.</li> \nConducting research to obtain information for incomplete documents and materials.</li> \nCreating digital documents from paper or dictation.</li> \nReviewing all documents and information for accuracy and informing the supervisor of any errors or inconsistencies.</li> \nCapturing data into digital databases and performing regular backups.</li> \nUpdating and maintaining databases, archives, and filing systems.</li> \nMonitoring and reviewing databases and correcting errors or inconsistencies.</li> \nGenerating and exporting data reports, spreadsheets, and documents as needed.</li> \nPerforming clerical duties such as filing, monitoring office supplies, scanning, and printing as needed.</li></ul></div>",
   "Title": "Administrative Assistant",
   "Company": "FreeWire Technologies",
   "Location": "New York, NY",
   "Posted time": "1 hour ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Administrative",
   "Employee type": "Full-time",
   "Industries": "Construction"
  },
  {
   "Description": " Alpha IR Group (www.alpha-ir.com) is a strategic investor relations consulting firm providing investment community intelligence and positioning strategies to publicly traded companies. Our goal is to help CEOs, CFOs, and IR teams of listed companies navigate the cycles of the public financial markets. We are looking for strategic thinkers that are dedicated to delivering exceptional client service. We have a   Financial Consulting Analyst   position available if you have  1-2 years of applicable work experience  within financial services, portfolio management, corporate finance, or related consulting.  This is an entry-level position.   \n   To be considered for this position you must:   \n \n Live in the Chicagoland area or have a plan to move here </li>\nInclude a cover letter with your attached resume</li></ul> \n   Initial responsibilities may include, but are not be limited to:   \n \nMonitor daily news and stock movements of our clients, their industry, and peers.</li>\nPerform periodic market research around key issues and topics that are impacting our publicly traded clients.</li>\nDraft and edit client materials including investor-facing news releases, financial presentations, memos, and factsheets.</li>\nCreate and drive quarterly deliverables and analyses for our clients using PowerPoint, Excel, and Word.</li>\nPerform regular analysis of client’s shareholder base and shareholder targeting strategies.</li>\nMonitor sell-side research and develop targeting strategies for additional sell-side coverage.</li>\nHelp with administrative tasks including coordination of press release distribution, earnings calls, and website updates.</li>\nAssist in responding to ad hoc client and investor inquiries.</li>\nSpend 10-20% of your time on the phone communicating to portfolio managers and analysts on Wall Street as “the eyes and ears on the Street” for our clients.</li></ul> \n   Qualifications:   \n \nBachelor’s Degree</li>\n 1-2 years applicable work experience </li>\nSolid foundation of corporate finance and accounting</li>\nOutstanding critical thinking, oral and written communication skills</li>\nStrong organizational and project management skills</li>\nDesire to provide top-notch client service</li>\nProficiency in PowerPoint, Excel, and Word</li>\nExperience using Capital IQ, Ipreo, Bloomberg and/or FactSet is considered a plus</li></ul> \n  This is an entrepreneurial opportunity and provides a chance for rapid career development. Candidates should be looking for a challenging, hands-on experience with a growing company. Strong financial writing skills are imperative and will be tested with a take-home exercise for those invited back for the second round of interviews. </div>",
   "Title": "Financial Consulting Analyst",
   "Company": "Alpha IR Group",
   "Location": "Chicago, IL",
   "Posted time": "23 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Finance",
   "Employee type": "Full-time",
   "Industries": "Sales"
  },
  {
   "Description": "The Illinois State Water Survey (ISWS) is seeking an Academic Hourly Research Assistant to conduct research and gather information from water and wastewater related websites, evaluate research data quality, develop written summaries based on research, and develop scientific content for water/wastewater operator website.</div>",
   "Title": "Research Assistant",
   "Company": "WaterOperator.org",
   "Location": "Urbana-Champaign Area",
   "Posted time": "42 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Research",
   "Employee type": "Full-time",
   "Industries": "Analyst"
  },
  {
   "Description": "\n Clever was founded four years ago to change how real estate is bought and sold. We connect home buyers and sellers with experienced, local real estate agents — and help them save thousands along the way.  \n  Our customers usually find us through the fantastic content our team writes, and we’ve gone from fewer than 10,000 monthly readers to more than 500,000 in the past year. Our content has been featured on Forbes, NBC, PBS, Realtor.com, The LA Times, and Politico, as well as hundreds of other reputable websites.  \n  As Clever continues to grow and develop, we’re excited to help millions of readers navigate their real estate journey. Headquartered in St. Louis, we offer remote work opportunities across the country (and even outside the U.S.).  \n   What it’s really like to be a Content Writer at Clever   \n  Let’s be honest: Most real estate content is confusing, misleading, or just plain wrong. We’re working hard to change that.  \n  Unlike other content companies, Clever is about quality over quantity — we value your insights over your ability to churn out blog posts.  \n  Our content team’s goal is simple but ambitious: to build a comprehensive library of real estate knowledge, becoming the go-to source of information for home buyers, sellers, and real estate investors.  \n  This is a reader-centric job where you simplify complex topics and help home buyers and sellers understand the wild world of real estate. Our commitment to Create Value means putting our customers and our readers first.  \n  You’ll get to work on a variety of projects and develop your writing career based on your skills and interests, working in a dynamic environment that values your creativity and input above the number of articles you can write per week. This isn’t a job where you churn out 10 articles a week and dread Mondays.  \n  We’re looking for enthusiastic learners who want flexibility and ownership over their work. You’ll collaborate with other best-in-class writers, editors, and content product managers to create content we’re all proud to put Clever’s logo on.  \n  Not an “SEO ninja” or “content marketing guru”? Don’t worry. Our team will help hone your content marketing skills so you’re ready to play an active role in our SEO research, CRO, and lead generating efforts. At the end of the day, we’re all united by our love for our readers, compassion for supporting our team, and dedication to how we’re transforming the world of real estate!  \n  Sounds too good to be true? Don’t take our word for it:  \n  “Clever is an incredibly supportive environment and everyone here goes out of their way to help you succeed. Instead of simply grinding out as many blog posts as possible, you're encouraged to create high-quality content that you can be proud of.\" - Michael Warford, Clever Content Writer  \n  “At Clever, you don’t work in a vacuum. There’s collaboration and discussion at every stage of the editorial process. You’re constantly learning and iterating on ideas with other team members to create the best possible content for readers.” - Andrew Whytock, Clever Content Writer  \n  “Clever embraces the opportunity to create genuinely helpful content, even if it means getting creative with how we dig up information readers need to know. I appreciate working in a supportive environment where quality is at the heart of the editorial process.” - Michelle Delgado, Clever Content Writer and Research Strategist  \n   What you’ll be doing as a Content Writer   \n \nWrite content that is clear, easy to read, and more engaging than what’s currently online</li>\nCommunicate complex topics in ways that are relatable and understandable</li>\nStructure content for readers using search engine data and keyword research</li>\nBring unique, thoughtful insights based on in-depth research, data analysis, or reporting</li>\nTurn readers into valuable leads for our sales team using CRO (conversion rate optimization)</li>\nManage deadlines during six-week sprints</li>\nPractice empathy for readers and curiosity to understand their needs and wants</li></ul> \n   Within one month you'll...   \n \nBegin your onboarding with a talented cohort of new writers and editors, collaborating as a team and building strong bonds</li>\nLearn about Clever’s sales, marketing, and engineering teams, and gain a clear understanding of Clever’s business model</li>\nUnderstand the types of readers Clever wants to attract</li>\nLearn Clever’s CMS, being able to easily upload and edit posts</li>\nDevelop skills in analyzing data on your post’s performance</li>\nReceive constructive feedback from our Content Product Managers to improve your voice, style, and structure of writing</li></ul> \n   Within three months you'll...   \n \nGraduate from onboarding and work on at least one project team</li>\nBe able to consistently create and edit new content that generates both traffic and leads</li>\nSee how the posts you’ve written drive traffic and leads for the business</li>\nBecome an expert in at least one area of real estate knowledge, and be ready to think about expanding to another</li></ul> \n   Within six months you'll...   \n \nHave achieved the top rankings for some of your highest value posts</li>\nOutperform goals for both traffic and leads</li>\nWrite about a variety of niches within real estate</li>\nBuild strong relationships with your colleagues</li>\nProvide feedback for process improvements to make the team more efficient</li>\nHelp train new writers by participating in team onboarding sessions</li></ul> \n   Within 12 months you'll...   \n \nBe maintaining many top rankings for your highest value posts</li>\nBe an expert in multiple verticals</li>\nBe eligible for advancement opportunities like becoming a Senior Writer, Product Manager, or Content Editor</li>\nLead new initiatives with the full support of Clever’s team and resources</li></ul> \n   Compensation &amp; benefits   \n \n$40k-$70k based on role and experience</li>\nCompetitive PTO</li>\nHealth insurance</li>\n401k plan</li>\nRemote work</li>\nPet-friendly office</li>\nFlex hours</li></ul></div>",
   "Title": "Content Writer",
   "Company": "Clever Real Estate",
   "Location": "Detroit, MI",
   "Posted time": "24 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Entry level",
   "Job function": "Marketing",
   "Employee type": "Full-time",
   "Industries": "Public Relations"
  },
  {
   "Description": " DATES: June 9 – August 25 2021   COMPENSATION: $14.00/hour  \n  MassChallenge offers an unparalleled opportunity for interns to impact the world in a big way. If you are a college student or post-graduate with a passion for people, innovation, and entrepreneurship, we want to meet you! MassChallenge internships are summer-long engagements that support all facets of business. We offer a flexible schedule, hands-on, real-world work experience, and a creative environment to learn and grow. Our Interns are self-directed individuals who are comfortable taking direction from team members, ask for help when they need it, and take the initiative to learn.   \n  This summer, MassChallenge is looking for a People Strategy Intern to join our People Strategy (Human Resources) team. You will report to our People Strategy Associate, Britt Walsh, and have the opportunity to work closely with the rest of our small team as well as other colleagues across the organization. In this role you will learn about and contribute to all aspects of human resources including team operations, hiring and onboarding, employee engagement, inclusion, diversity, equity, and accessibility, and more. We are looking for a utility player to support many areas of the team. The work will be hands-on, rewarding and fun. If you’re passionate about people, want to be exposed to startups, and are eager to learn about human resources then this is the role for you!     \n   Our Commitment to Inclusion, Diversity, Equity, and Accessibility (I.D.E.A.):  We are looking for individuals from underrepresented races, sexual orientations, genders, identities, abilities, and experiences to join our team, enhance our culture, and increase our diversity of thought. We recognize that skills are gained in many ways, whether it be through professional, academic, or lived experience. We also know that it’s not always easy to apply for a job if you’re not sure you check every box in the job description. There is no such thing as a ‘perfect’ candidate, so no matter your background and how you identify, we encourage you to apply for this job if it would make you excited to come into work every day. If you have any questions about any words or “lingo” in the job description, don’t hesitate to ask what we mean in your interviews with the team.   \n   A note on location:  our offices remain closed until September 2021 so this position will be fully remote. You can work anywhere in the United States and will need to work East Coast hours.   \n   What You’ll Do    Support and manage employee engagement events and activities through research, planning, communication, day-of execution, and debriefs.  \nHelp execute our 2021 strategy for our employee wellness program called MC3C. </li>\nSupport the summer intern program by serving as a peer lead and planning and executing the end-of-summer work showcase. </li>\nSupport ongoing culture-building activities with our Events team. </li></ul> Improve the operations of the People Strategy team.   \nReview current workflows, recommend how to improve them with our project management and collaboration tool Asana, and implement your recommendations. </li>\nClean up the People Strategy folders on our company SharePoint to ensure ease of access to important employee resources and information. </li></ul> Contribute to our inclusive hiring and inclusive onboarding efforts.  \nServe as the project manager as we update team overview videos for new employee onboarding. </li>\nResearch colleges and universities with entrepreneurship programs that can be future hiring sources for MassChallenge. </li>\nHelp build our interview question library through research. </li>\nSchedule interviews and onboarding sessions as needed. </li></ul> Contribute to other inclusion, diversity, equity, and accessibility work.  \nConduct inclusive benefits research for specific employee populations to identify opportunities for MassChallenge to expand our benefit offerings. </li>\nParticipate in our I.D.E.A. working groups by contributing to research, brainstorming, planning, and execution of projects. </li></ul> Help the People Strategy team get a head start on future projects as time allows.  \nResearch and make recommendations for creating an employee referral program. </li>\nCreate a template for welcoming new hires to MassChallenge on our social media like LinkedIn. </li>\nResearch and recommend ways to collect candidate feedback on our hiring process. </li></ul> \n   Who You Are   \nYou are detail-oriented and organized.</li>\nYou can meet deadlines and produce quality work. This means you are willing to put in the effort to get the job done right, not done right now.</li>\nYou are a quick learner who listens and asks good questions.</li>\nYou have the confidence to share your ideas, participate in business conversations, and take (or give) constructive criticism.</li>\nYou have a positive disposition, ability to play well with others and find the humor in chaos.</li>\nYou have strong customer service skills.</li></ul> \n   Who We Are    MassChallenge is the global network for innovators who are working to solve massive challenges. We connect startups, experts, corporations, and communities to grow and transform businesses and economies. At MassChallenge we:  \nHelp entrepreneurs build the next generation of transformational businesses by connecting them with the resources, partnerships, and communities that help them launch, grow, and scale their startups. </li>\nHelp our partners build, grow, and evolve their corporate innovation practices. </li>\nLeverage the power of entrepreneurship to strengthen global innovation ecosystems. </li></ul> \n   How We Work    Our mission is to equip bold entrepreneurs to disrupt the status quo and to create meaningful change. Our mission is BIG and so we are a team that gives 110% to it every day. Our Guiding Principles ensure we stay true to our mission and our core beliefs:  \nPut Community First </li>\nOwn It </li>\nLove the Problem </li>\nBuild for Impact </li>\nConnect and Collaborate </li></ul> \n   Why You Should Join Us    We believe working at MassChallenge is fulfilling because of the mission, challenging because of the pace and work, and rewarding because you get to build to the next step in your career here. When you join MassChallenge you join an incredible team and network of innovators and entrepreneurs, you take ownership over significant and strategically important projects, you focus on impact and output, and you help strengthen the global innovation ecosystem.   \n   How to Apply    In addition to completing the online application and providing your resume, please include a one-page cover letter in which you tell us why this job is compelling to you.  Employment at MassChallenge is contingent upon verification of identity and eligibility to work in the country that the position is based in, based on applicable laws.  </div>",
   "Title": "People Strategy Intern",
   "Company": "MassChallenge",
   "Location": "United States",
   "Posted time": "17 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Internship",
   "Job function": "Customer Service",
   "Employee type": "Internship",
   "Industries": "Human Resources"
  },
  {
   "Description": "  Paid Media Strategist   \n  About Us:    The Game Day is a new, fan-led content platform aimed at the US sports market. Set up by a highly successful, award-winning production &amp; social media team, The Game Day is a multi-platform content offering that looks to drive a sports-hungry audience to the very best sites offering stats, discussion and game coverage.  \n  The Role:    Reporting into the CEO, the Paid Media Strategist will be responsible for building paid media strategies and execution that meet the company’s goals on owned platforms and partnered campaigns. Working alongside the social and commercial department, the Paid Media Strategist will be primarily responsible for developing and maintaining strong paid media strategies across all social accounts and campaigns. The Paid Media Strategist will manage all paid campaigns on Google Ads, Facebook and other SEO web traffic tools  \n A successful Paid Media Strategist will effectively manage the paid search budget and work with the greater service delivery team in order to maximize ROI, drive traffic, and customers.  \n The ideal candidate will be able to marry their own network of connections with an understanding of the company’s audience growth strategy, with the ability to create a value-driven paid media strategy built on analytics and market intelligence.  \n  Responsibilities:   \n Run strategic paid media campaigns across all own TGD accounts  </li>\n Develop media plans, from initial brief to full plan, with direction from internal stakeholders.  </li>\n Track campaigns to ensure they are performing as planned meeting and/or exceeding client objectives and efficiency goals.  </li>\n Develop performance reports to analyze and monitor the paid activities effectiveness  </li>\n Prepare weekly/Monthly paid media forecasting for each account  </li>\n Regularly A/B test keywords, targeting, ad copy, visual assets, and other variables to improve the performance of ad spend in accordance with client goals  </li>\n Review and optimize the paid media strategy through analytics and ROI  </li>\n Manage the day-to-day client interaction participating in client status calls, providing media updates, and overall status of running campaigns managing client expectations  </li>\n Manage campaign budgets and client financials including media budgets, media spend summaries, and monthly media billing process.  </li>\n Research and analyze competitor advertising  </li>\n Perform ongoing paid keyword research, expansion and optimization  </li>\n Online media background, specifically with Sports brands, is preferred  </li></ul>\n  Qualifications:   \n Bachelor’s degree required  </li>\n Minimum 1-3 years of experience in a media planning role, with emphasis on digital (and integrated) planning and campaign management  </li>\n Demonstrated experience in digital media planning, managing, and optimizing resulting in high ROI, conversion rates, or other KPIs  </li>\n Advanced proficiency with Google and Facebook Ad tools    </li>\n Strong written and oral communication skills.  </li>\n Ability to multi-task and manage multiple projects simultaneously.  </li>\n Strong organizational and analytical skills to interpret performance.  </li>\n In-depth Excel knowledge experience: pivot tables, formulas, and data visualization tools  </li>\n Experience using G-Suite: Docs, Sheets, Slides, Microsoft (PowerPoint, Word)  </li>\n Experience tactically planning across biddable and native platforms in any of the following:  </li>\n Social: Facebook / IG, LinkedIn, YouTube DSP: TEADS, TradeDesk  </li>\n Search: Google / Google SA360, Microsoft Search  </li>\n Audio: Spotify  </li></ul>\n Knowledge in the various paid media and measurement opportunities across social, digital, and broader marketing mix Including but not limited to: Google Analytics  </li>\n MOAT/IAS/Doubleverify,Nielsen/Millward Brown/Oracle Measurement </li></ul></div>",
   "Title": "Paid Media Strategist",
   "Company": "The Game Day",
   "Location": "New York, United States",
   "Posted time": "13 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Associate",
   "Job function": "Strategy/Planning",
   "Employee type": "Full-time",
   "Industries": "Analyst"
  },
  {
   "Description": "  Biologist     New York, NY    $35-41/hour       Biologist  will work as part of a project team to discover new therapeutic targets.       Biologist Responsibilities:  \nPerform molecular cloning experiments.</li>\nCarry out tissue culture and other cell biology tasks.</li></ul>     Biologist Requirements:   \nBS or MS in Biology or a related field.</li>\nMust have at least 2 years of lab research experience.</li>\nMust have the following experience: Cell Biology, DNA isolation &amp; purification, molecular cloning, PCR, and tissue culture.</li></ul></div>",
   "Title": "Biologist",
   "Company": "Hunter International Recruiting",
   "Location": "New York, NY",
   "Posted time": "34 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Associate",
   "Job function": "Research",
   "Employee type": "Full-time",
   "Industries": "Science"
  },
  {
   "Description": " We are looking for qualified candidates to fill our 100% remote Business Analyst Role supporting our clients here in Washington DC! Our client is globally known in the non-profit space. They have a ton of work streams relating to financial and ERP solutions and are looking for a BA to support these with business process mapping, stakeholder management and much more.   \n  We need someone who can work independently, organize their workload and is truly business minded. Please see basic qualifications below:   \n \n4 to 6 years business analysis experience required.</li>\nGeneral knowledge and experience in Finance Operations, Accounts Payable or Vendor Data Management. PeopleSoft experience is preferred, but not required!</li>\nAble to execute PeopleSoft queries with direction/guidance in support of demonstrating the impact of business rules when applied.</li></ul> \n  If you feel this position relates to you please apply now as our client is working quickly to get this position filled! </div>",
   "Title": "Business Analyst",
   "Company": "Eliassen Group",
   "Location": "Washington, DC",
   "Posted time": "23 minutes ago",
   "Number of applicants": "Be among the first 25 applicants",
   "Senority level": "Mid-Senior level",
   "Job function": "Business Development",
   "Employee type": "Full-time",
   "Industries": "Sales"
  }
 ]
}