{
 "jobs": [
  " <u>Overview<br/><br/></u> Spurs Sports &amp; Entertainment (SS&amp;E) is seeking a person to join our Brand-Digital Team! The person in this role is responsible for assisting with, creating and distributing digital content on all of our SS&amp;E social channels. He/She will assist the digital department in creating digital content as well content management. Our ideal candidates will have a strong interest in learning digital best practices as well as creating video and graphic content. This is a seasonal and part-time opportunity.<br/>In every position, each employee is expected to: demonstrate alignment with SS&amp;E's core values and mission, collaborate with internal/external family members and demonstrate ongoing development.<br/><br/> <u>Responsibilities<br/><br/></u> Assist on game days with coverage including: managing photos, video highlights and other tasks as assigned. Utilize knowledge of Adobe Premiere Pro and Photoshop to help edit videos and graphics for content consumption for both ingame and postgame. Assist in uploading content on various platforms including franchise websites and YouTube. Assist in logging social content throughout the season. Archive both video and photo content across all franchises.<br/><br/> <u>Qualifications<br/></u> \n A passion for sports and preferred knowledge of all franchise games.</li>\n Basic knowledge of Facebook, Twitter, Instagram, YouTube and Snapchat.</li>\n Ability to work evenings, weekends and other non-traditional hours assist in content coverage.</li>\n Ability to work normal business hours at least 2+ days per week.</li>\n Knowledge of Adobe Creative Suite (Premiere, Photoshop, Illustrator a plus).</li>\n Proficient in Microsoft Office Suite (Excel, Word and Power Point) a plus.</li>\n Photography, videography skills a plus.</li>\n Must have high level of interpersonal skills to handle sensitive and confidential situations and information.</li>\n Demonstrate poise, tact and diplomacy.</li>\n Must possess a strong teamwork aptitude and excellent customer service skills.</li>\n Display effective oral and written communication skills.</li>\n The ability to work independently and coordinate multiple tasks.</li>\n Stand/Sit/Walk for long periods of time.</li>\n Ability to lift/push/pull 50 lbs on a regular basis.<br/></li></ul>EEO Statement<br/>* SS&amp;E is an Equal Opportunity Employer*<br/>Nothing contained in this job description is intended to be a contract of employment, nor does any information contained herein represent a guarantee of employment for a specific duration. Your employment with SS&amp;E is \"at will\", which means that either you or SS&amp;E may terminate the relationship at any time.</div>",
  "<br/>JOIN OUR PROFESSIONAL VOLUNTEER TEAM: PERSONAL ASSISTANT<br/><br/>Do you have all the education, passion, and drive as a professional, but due to the ever-changing military life, lack the hours of experience to add to your resume? <br/>We’ve got an opportunity for you! <br/><br/>JOB DESCRIPTION <br/><br/>It’s a Military Life is seeking a skilled military significant other or veteran professional to be the right hand person to the Founder of IML. The ideal candidate is knowledgeable, dependable, responsible, detail oriented, and well organized.  Candidates must be able to work independently and able to handle multiple communication platforms. This opportunity is best for someone looking to grow their resume and work experience. IML is all about supporting the military community!<br/><br/>RESPONSIBILITIES AND OBJECTIVES<br/><br/>* Manage Founder’s Calendar and Email within given parameters<br/>* Schedule team meetings while also providing effective minutes and notes <br/>* Act as Administrative Officer for IML and be the main POC for Founder <br/>* Able to moderate Founder’s Social Media accounts to include but not limited to postings, comments, replies, etc.<br/>* Works closely with the Founder to ensure she is up to date on all projects and deadlines are met in a timely fashion<br/>* Execute any other tasks and or projects assigned by Founder and COO<br/><br/>REQUIRED SKILLS AND QUALIFICATIONS<br/><br/>* Associate’s degree preferred<br/>* Experience or education in administrative or personal assistance preferred<br/>* Basic knowledge of Google Suite, Microsoft Office Products, Monday.com, and Zoom<br/>* Strong writing and communication skills<br/>* Must be responsive and possess the ability to anticipate and possibly respond to issues<br/>* Ability to handle multiple tasks and assignments while meeting necessary deadlines. <br/>* Ability to collaborate with others as well as work independently<br/><br/><br/>***This is a volunteer position. Volunteers will not be financially compensated. <br/></div>",
  "   BREAKING:    Rapidly-growing, cause-driven media strategy and public relations agency seeks diligent, persistent and thorough Media Relations Specialist with a passion for effective communication, knack for organization, eye for detail, strong relationship skills, and willingness to work in a high-intensity role.        WHY WE CREATED THIS ROLE:  We’re a   growing  , cause-driven agency representing values-based clients who are innovating and leading in impacting our culture for good. Excellence in media relations is critical to effective media outreach and best-in-class client service.       A DAY IN THE LIFE:  No two days are the same, but the core role involves booking media interviews, engaging with the media team and clients to produce desired deliverables, maintaining and updating media contacts database, researching potential new contacts and scheduling internal and client meetings...did we mention scheduling?       MUST HAVE:   \nWorld-class attention to detail </li>\nProactive, flexible attitude that can read the room and communicate effectively in remote setting </li>\nAvailability on evenings and weekends to book interviews that arise - not always, but it happens </li>\nAdaptability to learning and using new software and technology stacks </li>\nCan-do, adaptable attitude who finds no task too small</li>\nDedication to fundamental American principles of liberty and freedom</li></ul>     NICE [but not required] TO HAVE:   \nFamiliarity with media industry </li>\nExperience working in a remote setting </li>\nExecutive or administrative support experience </li>\nA solid gif game </li></ul>     WHAT’S IN IT FOR YOU [besides a paycheck]?  \nExperience working with a fast-paced media team interacting with top news outlets in the country </li>\nWork directly with leadership team that has extensive experience in non-profit, government, business, and political spaces</li>\nDo meaningful work every day that is directly impacting society for good </li>\nBuild relationships that will last a lifetime </li>\nFlexibility of a fully-remote work setting  </li></ul>     I’M IN, NOW WHAT?    This is a full-time, remote contract position with potential to become permanent and compensation is based on experience. </div>",
  "  Assistant Travel Designer   Apex, NC  Part-time   Company:  VIP Travel Designs is a boutique travel agency experiencing rapid growth.  Our main focus is unique luxury travel experiences, custom itineraries, and luxury cruises and resorts around the world.   Job Description:   Responsibilities include: \nCustom Itinerary Design</li>\nResearching vacation packages, cruises, and resorts</li>\nAssisting Travel Designer in curating Travel Proposals</li>\nDocument and Itinerary Packaging &amp; Delivery</li></ul>  Qualifications:   This is a part-time 10-15 hour position.  Must be able to work in the office located in Apex, NC.  We are seeking a highly qualified travel designer with past travel agency experience.  This position will assist the lead travel advisor in preparing proposals for clients and packaging final documents prior to travel.  This is not a public facing position, and the Assistant Travel Designer will not have client interaction.  We are seeking a seeking a self-driven candidate with superior organizational skills and a high-level of attention to detail.  Our clientele are premium and luxury clients.  A superior knowledge and experience of the luxury travel market is a \"must\".   Requirements:  \nHigh School Diploma</li>\nExceptional Organizational Skills</li>\nHigh Level of Attention to Detail</li>\nExcellent Written or Oral Communication Skills</li>\nIndependent Worker</li>\nAbility to Learn Quickly in a Fast Paced Environment</li>\nPast Travel Agency Experience </li>\nKnowledge of Hotel, Supplier, and Cruise Line Booking Engines</li></ul>  Helpful Skills:  \nProfessional Knowledge of International Travel Destinations</li>\nKnowledge of Travefy or other Itinerary Based Programs </li></ul> <br/>  Interested candidates should email a cover letter and resume.  <br/>  <br/> </div>",
  "A Coordinator is responsible for operational sales efforts related to the Company’s various events and services. Primary responsibilities include managing the event live process, handling multiple tasks and projects, anticipating event needs, discerning work priorities, and meeting deadlines with minimal supervision.<br/><br/> <u>Primary Responsibilities<br/></u> \nGuest service support and issue resolution via phone and email</li>\nFoster relationships with guests, hotels, transportation, other vendors, and services</li>\nCreate event and hotel (CCG/Prepaid) builds in proprietary programs/systems</li>\nSupport Sports Experiences team with preparation of event materials throughout the planning and execution of events</li>\nSupport event logistics such as guest check-in, ID, badges, and other items for distribution</li>\nAssist in fulfillment process to include ordering components, coordinating delivery of packages</li>\nAssist in creating and distributing event-related communications to applicable recipients (e.g. guest and hotel communications during changes)</li>\nWork in conjunction with and communicate closely with other departments as it relates to major events:</li>\nCompile and maintain event summary information such as tracking historic sales and hotel reporting</li>\nSupport Accounting with billing, reconciliation, and collection process for event services</li>\nAssist in process development by analyzing current processes, then identifying and communicating opportunities to streamline procedures that directly impact productivity</li>\nCultivate a working knowledge of all events/services to provide customer support; assist Customer Service with incoming sales calls<br/><br/></li></ul> Travel<br/><br/> Must be flexible with work and travel schedule. Ability to travel for work during holidays. This position may require a minimum of 25% travel.<br/><br/> <u>Qualifications<br/><br/></u>  Required Education and/or Experience<br/> \nBachelor’s Degree in Hospitality, Sports Management, Marketing, Business or a related field, or equivalent experience</li>\nMinimum of 1+ years in the sports, travel and/or hospitality industry</li>\n Hotel contracting experience is required for consideration </li>\n The ability to enter into negotiations understanding both parties needs and wants and ultimately partnering to obtain win/win results for the client, On Location and vendor </li>\nProficiency in Microsoft Office applications; in particular Excel and Outlook</li>\nProduce accurate work, event when under pressure, checks the accuracy of information before using or passing on to others<br/><br/></li></ul> <u>Preferred Education And/or Experience<br/></u> \nExceptional interpersonal skills – a collaborative style and ability to communicate effectively at all levels with strong oral, written, and presentation skills</li>\nContinually striving for self-development and discovering better means of accomplishing both personal and professional goals</li>\nCollegiate sports and/or event operations</li>\nTravel &amp; Hospitality experience<br/><br/></li></ul> About On Location Events LLC:<br/><br/> On Location is a leader in premium experiential hospitality business, establishing a new industry standard to serve iconic rights holders with extensive experience in ticketing, curated hospitality, live event production and travel management in the worlds of sports and entertainment. On Location is a partner to over 150 rights holders including the NFL, NCAA, the PGA of America and the United States Tennis Association, and provides unrivaled official access for both corporate clients and fans looking for immersive experiences at marquee events including the Super Bowl, Pro Bowl, NFL Draft, NCAA Final Four, PGA of America events, numerous College Football Bowl Games including the Rose Bowl Game and the Tennis Majors. On Location through CID Entertainment &amp; Future Beat also partner with numerous artists and music festivals across genres, including Imagine Dragons, Metallica, Luke Bryan’s Crash My Playa, Electric Daisy Carnival, Migos, Post Malone, Iron Maiden, and J.Cole.On Location’s operations include: Anthony Travel, CID Entertainment, Future Beat, Kreate Inc, PrimeSport and Steve Furgal’s International Tennis Tours.On Location is part of the Endeavor network.</div>",
  " At Inflection, our mission is to build trust by harnessing the power of data. To achieve our ambitious goals, we’re growing a diverse and inclusive team of collaborative, adaptable, hard-working people who are passionate about solving problems and achieving success. We’re dedicated to providing a company culture that’s inclusive, engaging, supportive, and where employees can grow and thrive.  <br/>  We’re looking for an energetic and creative self-starter to join our HR Team. As the Culture and Employee Engagement Manager you will develop, implement and measure company wide initiatives that drive employee engagement and promote key objectives of the organization. You’ll be a driving force for cultural transformation to support our transition to a mixed on-site, off-site company.    <br/>  You will work cross-functionally to support and execute strategies that create a meaningful employee experience through the entire employee lifecycle. As part of our broader employee engagement work, you will help create and implement programs that create a delightful work experience. A successful candidate cares deeply about building culture while maintaining Inflection’s core values and has experience in human resources, event planning (in person and online events), customer service, and project management.  <br/>   WHAT YOU'LL DO:  \nCreating and owning innovative initiatives to enhance the employee experience in support of successful execution of company’s objectives</li>\nAdministering our gifting and recognition programs and platforms</li>\nExecuting and coordinating various employee surveys; administering survey platforms</li>\nReporting results and proposing course of action based on surveys</li>\nFormatting and maintaining an internal employee engagement channel with updated communications and activities</li>\nPublishing quarterly calendars mapping special events, weekly huddles, all hands, monthly bday / anniversary celebrations, MVP awards, holiday events, etc.</li>\nTracking and maintaining engagement metrics to measure program effectiveness, communicating results to CAO</li>\nAdministering Diversity and Inclusion initiatives</li>\nSupporting recruiting and employee development</li>\nCoordinating employee engagement initiatives and programs for employees in various time zones</li>\nOrganizing and leading weekly huddles and all hands meetings including defining agenda (aligning with CEO, COO, CFO on key topics) and coordinate presentation (presenters)</li>\nProviding administrative support to the HR Team as needed</li>\nStaying up to date on current trends around culture and employee engagement</li></ul> <br/>   YOU'LL BE A FANTASTIC MATCH FOR THIS ROLE IF YOU BRING:  \nBachelor's degree (in Communication or HR is a plus!)</li>\n2+ years total related work experience at a fast-paced and growing company</li>\nPassion for developing an organizational culture that is rooted in Inflection’s Core Values</li>\nAbility to lead and be proactive</li>\nAbility to interact with all levels of employees</li>\nStrong interpersonal skills</li>\nStrong desire for collaboration and teamwork</li>\nExcellent writing and verbal communication skills</li>\nAbility to communicate information visually</li>\nDesire to champion new employee engagement strategies</li>\nCreativity and willingness to try new things</li>\nAbility to balance multiple priorities simultaneously</li>\nAbility to follow through on commitments and meet assigned deadlines</li>\nComfortable with consistent change</li>\nStrong desire to problem solve, execute, and drive results</li>\nAbility to be forthright when something is not working effectively</li>\nHigh degree of organizational and time management skills</li></ul> <br/>   TO WIT, INFLECTION OFFERS:  \nInnovative, high growth products that customers love</li>\nCompetitive compensation including equity options</li>\nComprehensive insurance benefits package including medical, dental, vision, and life insurance</li>\n401K</li>\nTrack record of promoting and hiring internally</li>\nStartup environment with big opportunities for impact</li>\nHigh energy team with mix of experienced entrepreneurs, talented engineers, and successful Silicon Valley/Prairie veterans</li>\nLearning and Development funds to enhance and learn new skills</li>\nDiversity and Inclusion program</li>\n3 days off per year to volunteer</li></ul> <br/>   YOU BELIEVE WORK IS ABOUT MORE THAN JUST THE BOTTOM LINE   <br/>  We don’t want to just be good at what we do; we want to be good for the world. We’ve met rigorous standards of social and environmental performance, accountability, and transparency. We care about all stakeholders, including customers, employees, and the community. </div>",
  " Position: Sales Assistant – Home Textiles  We are looking for a qualified candidate to fill the position of SALES ASSISTANT. Position is based in our Manhattan office and is not remote. Candidate must be very well organized, ambitious, self-motivated, open to challenges, and an excellent communicator. Candidate must have knowledge of textiles, colors, and fashion trends.  REQUIREMENTS: \n4 year college degree</li>\n2+ years of experience in home textiles or apparel industry</li>\nSuperior analytical and interpersonal skills</li>\nExcellent time management and organizational skills</li>\nTremendous attention to detail and great follow-up</li>\nMust be very fast with computers and proficient in Microsoft Office including Word, Outlook, PowerPoint. Must be Highly proficient in Excel.</li>\nKnowledge of Photoshop and accounting software is a plus</li></ul> RESPONSIBILITIES: \nFollow up with buyers of major customer accounts (nation-wide department chain stores) for new sales, obtaining missing purchase order details, send samples/pics</li>\nOrganize and prepare line sheets, samples for sales presentations and emails</li>\nThorough communication and develop relation with buyers to understand their requirements and accordingly make sales offers</li>\nDo competitive market research; and present ideas in an organized and comprehensive manner</li>\nUpdate and enter data in the system</li></ul> <br/> </div>",
  "  Anita Goodesign is the industry leader in home embroidery designs, quilting designs, and education. We are seeking a Creative Associate to join our growing team.    <br/>   Our ideal candidate would possess:      *Ability to work in an exciting, fast paced, team environment with long periods of standing  *A keen eye for coordinating color with fabric and thread as it relates to the embroidery design  *Ability to run commercial embroidery machines (will teach on the job)   *Strong attention to detail to assist in quality control of the product  *Ability to multi-task and prioritize to meet deadlines  *A creative mind to add project and design ideas  *Passion to write technical instruction (creative writing skills a plus)  *Willingness to learn basic photography skills  *Ability to work well both independently and on a team   *A pleasant in-person demeanor with a focus on the customer  *Ability to resolve issues and think independently  *A willingness to always strive for better    * Capability to learn basic Adobe platform software such as InDesign and Photoshop  *Close attention to detail and color theory background a plus, but not required   </div>",
  " About the job  Who We Are  Here at Pieology, our vision is to “Serve Individuality by providing all the right ingredients for all the ways that you do you, because what makes you different is what makes us amazing!” So whether it’s personalizing your own pizza, or modeling your true nature and self at work, we encourage and embrace your individuality!     We operate within a values-based culture. We work together with respect, accountability, and support. We approach teamwork with gratitude and continuously strive to create an unrivaled experience, for both the guest and our teammates. At the end of the day, nothing is better than happy people eating tasty pizza! Come join our team!  <br/>  Marketing Coordinator  The Pieology Marketing team is looking for a highly motivated individual with demonstrated strengths in project management, marketing program development, and relationship management. This position is ideal for individuals with high accountability, strong attention to detail, great communication style, a collaborative spirit, and a passion for fun.     Responsibilities \nWork closely with the social media team to manage, create and schedule new initiatives</li>\nInfluencer outreach support</li>\nSupport in digital and in-store marketing events</li>\nTracking guest response/feedback during big launch campaign periods</li>\nSupport monthly photoshoots</li>\nCoordinate quotes, proofs and order materials for execution of new product launches and marketing campaigns</li>\nPartner with the creative team to ensure the content and creative treatment of all marketing initiatives reflect the strategic direction and priority of messaging in an engaging and compelling manner</li>\nCoordinate local and national email and digital campaigns</li>\nMaintain menu pricing &amp; coupon master documents</li></ul>    Qualifications \nDemonstrates Creative and Strategic Thinking</li>\nDetail-Oriented and Highly Organized</li>\nExcellent project management and communication skills</li>\nAbility to prioritize requests and handle multiple tasks simultaneously</li>\nAbility to communicate and receive constructive feedback from multiple business partners</li>\nSelf-Motivated, Takes Initiative</li>\nFlexible, works well independently, and as a team player</li>\nBachelor’s Degree in Marketing, Communication or related field preferred.</li>\nDigital marketing experience highly preferred</li>\nStrong computer skills, including Powerpoint, Word, Excel, and Teams</li></ul> ·      Adobe Photoshop proficiency preferred  <br/> \n<br/></li></div>",
  "[Administrative Assistant / Remote] Anywhere in U.S. / Competitive pay / Full benefits (Medical-Dental-Vision-401K-PTO) - As a Data Entry Specialist you'll: Accurately key work order and invoice data from service providers into the TFS system; Meet or exceed weekly targets; Work with vendors when required information is missing; Audit invoices and dispute unnecessary or unreasonable charges; Track cost savings...Hiring Fast &gt;&gt;</div>",
  " Thomas Insights is the content branch of Thomas. Through our content platform and our daily newsletter sent to 300,000+ subscribers, we cover daily news and analysis for industrial professionals. Our mission is to provide readers with unique perspectives on the diverse areas of industry and share the information they need to successfully run their businesses and advance their careers.  <br/>  We’re looking for an eager, organized editor with experience reviewing, writing, and interviewing in a deadline-driven, fast-paced environment. The right candidate will enjoy working independently to develop original, engaging content and organize production tasks, but should also appreciate a team atmosphere in which to collaborate, learn, and further develop their content skills.  <br/>   What we look for in our employees:    <br/>   Inclusive:  We believe that different perspectives and experiences are an asset to innovation. A fresh set of eyes and an open mind are vital keys to driving better business decisions. We take extraordinary measures to ensure all people and ideas are welcomed onto the team.  <br/>   Curiosity:  We ask “What If...?” and constantly push the boundaries of what’s possible. We pursue continuous improvement and encourage an unrivaled sense of vision and execution. We ask questions and continue to seek opportunities to learn, discover, and innovate. We don’t fear the unknown.  <br/>   \"WeGetThingsDone\" attitude:  We’re focused on being the very best at what we do.We accomplish this by working collaboratively until the job is done. Our team can overcome challenges, find solutions, and deliver excellence. We don’t just meet expectations, we exceed them.  <br/>   Here's how your role as our Junior Editor is broken down:   <br/>   Copy Editing  (40% of role)    Review articles for publication on Thomas Insights and in the Thomas Industry Update (TIU), our daily newsletter distributed to 300,000 subscribers. This includes copy editing, proofreading, and fact-checking all content, in addition to ensuring all content meets our quality standards.   <br/>   Content Development and Production  (35% of role)    Develop original content following the Thomas Insights Style Guide. This includes ideation, research, writing, and interviewing sources. The Junior Editor will utilize our custom CMS to set up articles for publication, maintain a rolling editorial calendar of upcoming articles, identify new story topics for future production, select stories for daily publication, and analyze published content performance to determine what worked and what didn’t for future content development.   <br/>   Client Account Management  (25% of role)    Manage multiple client accounts (assigned on a monthly basis) simultaneously to deliver strong content marketing to our diverse industrial clients. The Junior Editor will develop content, optimize client-provided content, strategically plan publication schedules, provide marketing recommendations, and communicate with both clients and Certified Thomas Partners (our external sales team members) on a regular basis.  <br/>   Here's what you bring to our team:   \nBachelor’s degree, preferably in Journalism, Communications, or English.</li>\n2+ years of writing experience preferred, ideally with at least 1 year spent working in a fast-paced content production environment working on both long-form, in-depth feature research stories and short-form, deadline-driven stories. </li>\nExperience interviewing sources for content pieces or experience in another client-facing role. Candidates must be comfortable speaking with clients. </li>\nImpeccable organization skills and ability to manage own workload under deadline. </li>\nExcellent communication skills combined with the confidence and ability to lead discussions among a variety of team members and clients.</li>\nStrong writing, editing, and proofreading skills, especially in translating somewhat complex information for broad audiences. </li>\nProficient with MS Office and Google Drive. Familiarity with AP style encouraged.</li>\nKnowledge of industrial manufacturing is helpful but not required. (Training will be provided.)</li></ul> <br/>  Thomas is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. Thomas believes that diversity is critical to our success in delivering great workplace experiences and is committed to creating an inclusive, mutually respectful environment which celebrates diversity of our people. We seek to hire on the basis of merit, competence, performance, and business needs. </div>",
  "Do you love to travel? We are looking for people to join our team of Remote Travel Agents who will book vacation packages, staycations, cruises, excursions/activities, sporting events, hotels, and more. Our ideal travel agent partners will have a strong passion for traveling, be motivated to work independently, possess outstanding customer service skills, and a 'Can-Do' outlook on everything that they embark on when starting a new venture. No experience necessary; however, if you have experience in sales, marketing, customer service, and/or travel, this opportunity will be a win-win for you! Must be 18 years or older, own a computer and cell phone, have good internet service, be coachable, work well with your peers, and ready to market on social media, or learn how to with patience and guidance. Setting Zoom Meeting Meetings all week! Apply today to learn more and get started immediately! Sign-on bonus opportunity for those who join our team in April as well.<br/><br/>SDL2019-1032</div>",
  "We are seeking a Media Relations Strategist to join our Carmichael Lynch Relate team.<br/><br/>A media relations strategist at Carmichael Lynch Relate develops and executes successful media relations strategies that support the overall business goals and priorities of the agency and agency clients. The media relations strategist works closely with account teams and clients to provide strategic media relations counsel, develop effective media relations plans, execute those plans and evaluate the results of that outreach.<br/><br/> <u>Areas Of Focus<br/></u> <ul> \nCreate comprehensive media relations strategies for a variety of clients in industries such as home &amp; design, CPG, food, health care and business, for both consumer and trade/industry audiences.</li> \nDevelop and maintain strong media contacts for the agency by creating networking opportunities and leveraging existing opportunities, and being a thorough consumer of news outlets and current events.</li> \nIdentify and execute appropriate tactics to support clients’ media relations goals, e.g., pitching, events, desksides, news surveys, media tours, etc.</li> \nWrite press releases, pitches, and contribute to PR plans.</li> \nNavigate the frequent pivots of pitching around current events by bringing a steady stream of ideas to teams and clients</li> \nMonitor media developments/trends and share with agency and clients</li> \nOversee development of media lists and pitch logs</li> \nEnsure agency is successfully tracking media coverage</li> <br/><br/></ul> <u>What We Believe<br/><br/></u> We believe that when the best of strategy and creativity come together, brands stand apart.<br/><br/> <u>Our Hiring Philosophy<br/><br/></u> Carmichael Lynch and Carmichael Lynch Relate are committed to creating a diverse, safe and welcoming workplace with opportunity for all. We strive for inclusion, equity and diversity in both our words and actions. BIPOC, women, marginalized communities, LGBTQIA+, veterans and persons with disabilities are encouraged to apply. To learn more, please visit: https://www.carmichaellynch.com/about/<br/><br/> <u>What’s In It For You<br/></u> <ul> \nProfessional Development (performance reviews 2x annually, training opportunities related to your field of development, one-on-ones with managers, etc.)</li> \nWe offer competitive, equitable salaries (reviewed annually to ensure equity and competitiveness)</li> \nA strong, vibrant, continually-evolving Diversity, Equity and Inclusion belief (in thought and action), encompassing our agency and our Employee Resource Groups (ERGs). Recognizing the voices that need to be heard.</li> \nCompetitive, company and employee sponsored benefits, including: Medical, Dental, Vision, 401k (company matched 50% of first 6%), PTO (vacation/sick time) allowance, 12-week maternity leave, 6-week parental leave, 20 paid company holidays, Family Building Benefit (adoption, surrogacy benefit), tuition reimbursement and much more.</li> <br/><br/></ul>  NOTE: Carmichael Lynch and Carmichael Lynch Relate never market job listings via email and, at this time, we do not work with outside recruitment agencies. We do not charge a fee to apply for any of our roles. We strongly recommend you do not provide personal data to any direct solicitation via email or messenger and report or remove any suspicious senders from your contacts list.<br/><br/>   <u>Required Skills<br/><br/></u>  Qualifications/Traits:<br/><br/>  <u>Education<br/></u> <ul> \nA bachelor’s degree in public relations, journalism or a closely related field</li> <br/><br/></ul> <u>Skills And Experience<br/></u> <ul> \nA minimum of four years of public relations or relevant work experience in one of the following areas: prior agency, communications or media;</li> \nsolid writing skills;</li> \nrelationship building with media, account teams and clients;</li> \nteam building skills and motivation.</li></ul></div>",
  "Description of Work<br/>HIRING SALARY:$32,397 - $35,298<br/>POSITION TYPE: 11 Month EHRA Professional, FLSA Exempt, 1.0 FTE<br/>The general working hours will be Monday through Friday 11am - 8pm with some evening and weekend hours for coverage of athletic and school events.<br/>Responsible for coordinating the setup of varsity sports events at NCSSM. Manage campus service for students who are assigned to the department for each trimester. Serve as the administrator/representative from the Athletics Department for varsity games when the Director of Athletics is unable to attend. Serve as department liaison to a select number of club sports organizations; serve as an advisor and mentor to respective club officers and club members. As needed, assist with the Intramural Program and provide game support in areas such as scorekeeper and clock operator for Varsity games.<br/>Responsible for the programming, supervision and scheduling of 3-5 temporary employment Physical Education Center weekend and evening supervisors. Work with Director on the marketing and promotion efforts for NCSSM varsity sports and wellness programs. Some items could include updating NCSSM athletics website and social media outlets, communications to NCSSM students, parents, and staff.<br/>Assist with the administrative needs for the PAW department. This includes completing budget paperwork for state, NCSSM foundation, and NCSSM SCSSI funds. Responsible for keeping accurate accounting/budget records and providing budget information to the Director. Responsible for the collection and reporting of money to the SCSSI Funding Officer.<br/>Responsible for the preparation and completion of all temporary employment, additional employment, and independent contractor paperwork and payment for coaches, game officials, and PEC supervisors. Meet with employees in groups and individually to have hiring forms completed. Work with HR and Payroll to ensure accurate and timely submission of forms and paperwork. Develop, implement and manage a plan for Wellness at NCSSM to include all parts of campus (Faculty, Staff and Students). Work with other campus initiatives in Academic Programs and Student Life that involve wellness.<br/><br/> <u>Knowledge, Skills And Abilities / Competencies<br/><br/></u> Experience working effectively in team settings. Understanding of contemporary issues in education, particularly those related to athletics and/or student wellness. Strong leadership, organizational, and communication skills. Ability to collaborate by establishing and maintaining effective working relationships with faculty, staff, students, and parents. Planning, implementation, and evaluation skills. Ability to maintain confidentiality and to handle situations with great judgment. Basic computer skills to<br/>include Microsoft Office products (Word, Excel) and proficiency in using the Google Applications Suite.<br/><br/> <u>Minimum Education And Experience Requirements<br/><br/></u> Bachelor's Degree Required. A Bachelor's Degree in Recreation, Sports, Management, College Student Personnel, or a related field.<br/>Preferred experience: minimum of two years of experience working in a recreation, athletics, sports management, or educational setting. Experience working with supervising or advising student leaders. Experience in the organization of club sports, recreational sports programming, or camp programming. Experience with technology as it relates to daily processing and statistical tracking. Possess First Aid and CPR Certifications (must be obtained within 6 months of employment).<br/>Supplemental and Contact Information<br/><br/> <u>About NCSSM<br/><br/></u> North Carolina School of Science and Mathematics(NCSSM) challenges academically talented students from across the state with a comprehensive curriculum including highly specialized courses in science, technology, engineering/computer science, and mathematics. NCSSM opened in 1980 as something of an academic experiment: Would something excellent happen if we gathered together a highly motivated and diverse student body with a critical mass of equally motivated, accomplished, credentialed, and diverse faculty within a space dedicated to the power of the scientific method? Four decades later, NCSSM has built a firmly rooted reputation as an academic powerhouse, educating intellectually gifted students from every corner of the state, representing rural and urban communities, and all socioeconomic and ethnic backgrounds. Eleven states and several countries worldwide have since used NCSSM as the model for their own programs.<br/>Today, as in 1980, the mission of NCSSM, an intellectually stimulating, diverse, inclusive, and collaborative community, is to:<br/>\n educate and nurture academically talented students to become state, national, and global leaders,</li>\n increase access to high quality public education in North Carolina, and</li>\n cultivate engaged citizens who will work for the betterment of the world,<br/></li></ul>through challenging programs, with an emphasis on STEM, driven by the pursuit of excellence and innovation.<br/>Altogether, nearly 1,500 North Carolina students from all 13 congressional districts and nearly all 100 counties are enrolled in one of our three signature programs: our residential diploma program, our online certificate program or our Open Enrollment Distance Education program.Our Open Enrollment courses, taught via interactive video conferencing, expand local offerings to include enrichments and advanced coursework otherwise unavailable in students' home communities. NCSSM instructors teach live to classrooms statewide daily, broadcasting more synchronous video than any other public provider in the state.<br/>By 2022, NCSSM will expand to an additional campus in Morganton, NC. Funded by the Connect NC Bond, legislative appropriations, and private philanthropic gifts, the campus will initially accommodate 300 additional residential diploma program students as well as increased distance education enrollment.<br/>NCSSM has more than 11,000 alumni, nearly all of whom attended colleges and universities (a great majority within our own top NC public universities) and nearly three-quarters of whom have earned or are seeking a graduate degree. According to a 2019 survey of alumni who attended the school between 1980 and 2018, 64 percent of NCSSM college graduates earn a bachelor's degree in a STEM field -- over three times the national average for high school graduates. And 58 percent of NCSSM underrepresented minority (URM) graduates earn an undergraduate degree in a STEM field -- nearly four times the national average for URM students. A 2020 economic impact study found that 54 percent of our alumni continue to live and work in North Carolina, catalyzing nearly $1.3 billion in economic activity and making priceless contributions to our quality of life as teachers, physicians, scientists, entrepreneurs and other community leaders. Many of our graduates, the oldest of whom are in their mid-50s, refer to their time at NCSSM as \"life-changing\" and continue to support theiralma materwith charitable gifts, volunteerism, and other purposeful engagement.<br/>Our school is a full constituent of the University of North Carolina System and is governed and supported by the UNC Board of Governors, NCSSM Board of Trustees, NCSSM Foundation, NCSSM Alumni Association, NCSSM Parent Association, NCSSM Faculty Senate, NCSSM Staff Senate, and NCSSM Student Government Association. Notably, a representative from each of our Faculty Senate, Staff Senate, and Student Government Association serve as ex-officio, non-voting members of our Board of Trustees.<br/>NCSSM operates as a free public school open to qualified NC students, regardless of financial means. We generate more than 10 percent of our institutional budget from private donations, a ratio that will likely increase as we undertake a comprehensive fundraising campaign.<br/><br/> <u>Though Goals May Shift From Time To Time, Our Core Beliefs Have Remained Fundamentally Unchanged Since Our Establishment<br/><br/></u> Consistent with our founding and governance, the institution is guided by a standingstrategic plan.<br/>\n Our greatest resource is the capability and creative capacity of the human mind.</li>\n Everyone is unique and has intrinsic value.</li>\n Diversity and inclusion enrich and strengthen lives and communities.</li>\n Embracing challenge inspires growth and the pursuit of excellence.</li>\n Individuals are responsible for their choices and actions.</li>\n With opportunity, support, and effort all people can realize their full potential.</li>\n A nurturing community develops the well-being of the whole person.</li>\n Service to others builds and strengthens our community.</li>\n Environmental stewardship and resource sustainability are a shared responsibility.</li>\n A passion for learning throughout life leads to success and fulfillment.</li>\n Collaboration fosters learning, ignites innovation, and cultivates community.</li>\n Adhering to high ethical standards is essential for a community to function and flourish.</li>\n Access to high quality public education is essential to a free, democratic society.<br/></li></ul>We invite and welcome all applications for employment within our institution. NCSSM is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sex, gender identity, age, sexual orientation, genetic information, status as an individual with a disability, or status as a protected veteran. If you are an individual with disabilities requiring accommodations in the application and interview process, please contact us at (919) 416-2662.<br/><br/> <u>How To Apply<br/><br/></u> Submit electronic application via:http://www.governmentjobs.com/careers/northcarolina/. Please create an account, search for the Coordinator of Physical Activity and Wellness vacancy, and complete/submit online application.<br/>Please complete your application in full. All required Competencies, Work History, and Credentials must appear on the application in the Education and Work Experience sections of the application to receive consideration during the selection process. Resumes will not be accepted in lieu of completing the State Application form in its entirety. \"See Attached Resume or an Embedded Text Resume\" will be considered incomplete and will not be processed. Degrees must be received from appropriately accredited institutions.<br/>Applicants seeking Veteran's preference must attach a DD-214 form, Certificate of Release or Discharge from Active Duty, along with the application. Final candidates are subject to criminal and sex offender background checks. Some vacancies also require credit or motor vehicle checks. If highest degree is from an institution outside of the U.S., final candidates are required to have their degree equivalency verified atwww.wes.org or equivalent service. NCSSM participates in E-Verify. Federal law requires all employers to verify the identity and employment eligibility of all persons hired to work in the United States.<br/>Please refrain from submitting multiple applications. However, if multiple applications are submitted to a posting, only the most recent application received prior to the posting close date will be accepted. There is a 24 hour waiting period before an applicant can re-apply to a position.<br/>If you have questions, please contact Tracy Fullgraf at 919 416-2663 orfullgraf@ncssm.edu.<br/>NCSSM is an EEO/eVerify/VEVRAA Employer</div>",
  "    About the job  Canon Business Process Services is looking to add a Social Media Coordinator to the team.     Responsibilities include, but are not limited to:  ·        Conduct community management, proactive and reactive conversations, for all of our client’s Social Media channels.  ·        Post and schedule all client-approved content across their Social Media channels.  ·        Lead Social Media reporting for clients, to showcase business results and successes, key learnings and optimizations.  ·        Converse with the team regularly to understand the campaign performance and how those learnings impact future Social Media campaigns, i.e. content that would perform well for paid or organic programming.  ·        Strategically monitor and recommend platform updates and tools, such as Q&amp;A features on Instagram Stories and shoppable tags, to ensure relevancy with our target consumer(s).  ·        Assist with creative briefs, outlining strategy and concepts for client campaigns; ensure briefs are executed in alignment with strategy and client standards.  ·        Assist the Creative Strategist with briefing all creators to receiving final execution of creative plans.  ·        Assist with the execution of Social Media content calendars; supporting with copywriting and identifying hashtags, as well as outlining the scheduled Social Media posts to ensure they have the most premium and desired aesthetic.     Ideal candidates would:  ·        Have prior internship experience working in social media management  ·        Strong understanding of the Social Media landscape including Facebook, Instagram, Twitter, YouTube, Pinterest, TikTok, and any emerging platforms.  ·        Excellent written and verbal communication skills.  ·        Familiarity and expertise with our tools and services to generate proper Social Media reporting, such as Sprout Social, Social Bakers, etc.  ·        Photoshop skills is also a plus!  Job Details  Seniority Level  Entry level  Industry  ·        Public Relations &amp; Communications  Employment Type  Full-time  Job Functions  ·        Marketing     \nPublic Relations </li></ul></div>",
  " <u>Job Description<br/><br/></u> Were looking for an Assistant Media Planner (AMP) who is interested in media and advertising. As an AMP, you will work closely with Media Planners and Senior Media Planners to develop and maintain media plans, all the while absorbing as much media knowledge as possible. This is an entry-level position with great opportunities for growth.<br/><br/> <u>Responsibilities<br/></u> \nCoordinate weekly updates on all accounts to be shared via email with the company</li>\nWork closely with media team to review action item deliverables on a daily basis</li>\nMaintain account files and documentation on server</li>\nMaintain client media buy details</li>\nPrepare and maintain online creative traffic masters gather ad specs to be shared with client/creative agencies</li>\nPrepare media authorizations and maintain updates</li>\nPrepare and maintain reconciliation reports, including running reports from MediaMind/DART to update booking system with current month end activity</li>\nMonitor and reconcile client/vendor billing</li>\nIssue insertion orders (IOs) and change orders (COs)</li>\nManage due dates of tracking reports</li>\nWork with media team to track online programs pacing, performance, etc.</li>\nUpdate client status reports</li>\nPrepare screenshot presentations</li>\nTraffic lead gen assets as needed</li>\nCollect leads from media partners, and organize, scrub, and prepare summaries as needed</li>\nGather market and media research, and compile competitive spend reports</li>\nWork closely with media and account teams to develop and maintain media plans</li>\nAssist in sending vendor RFPs and collect/organize completed RFPs</li>\nFormat, proof, and prepare PowerPoint presentations as needed</li>\nPrepare POVs (point of views) on opportunities presented to us</li>\nSchedule vendor meetings</li>\nLEARN AND HAVE FUN!<br/></li></ul>SDL2019-1032</div>",
  " This position works closely with the marketing team to enhance the company's web presence, communications, and digital operations to further strengthen the corporate brand.  <br/>  Job Duties &amp; Responsibilities  30% Manage day-to-day operational aspects of the digital marketing strategy to further the  company's online footprint.  <br/>  25% Responsible for supporting, integrating, and training people on the digital marketing platforms  and tools so that stakeholders can easily and effectively communicate with their audiences.  <br/>  25% Responsible for implementing digital marketing plans and initiatives and reporting results to help  support various project needs.  <br/>  15% Responsible for consulting with internal clients to ensure that digital best practices, brand  positioning and messaging is consistent and compliant across Allied's digital channels.  <br/>  5% Other duties as assigned.  <br/>  Qualifications  Bachelor's degree in Digital Marketing or related field is required  1 - 3 years' of digital marketing experience... </div>",
  "  marketing coordinator    tampa,fl   <br/>  Since 1988, AIM Communications, LLC has been the publisher of Window Fashion VISION magazine, American Cake Decorating Magazine, and producers of the International Window Coverings Expo. We are proud to be a female and family-owned communications and publication firm with offices in St. Paul, MN, and Tampa, FL.   <br/>  AIM Communications, LLC is currently seeking a part-time Marketing Coordinator ( Freelance/Contract ) to assist in our marketing department to support marketing communications and administration tasks. The ideal candidate will hold excellent communication skills ( in-person and remote ) with the ability to manage deadlines and work independently. This position will require a 20-30 hours per week commitment and combines both creative, organizational, and analytical skills.   <br/>   Job Description:   <br/>   ADMINISTRATIVE:   <br/> \n Working directly with CEO &amp; Publisher </li>\nManage and optimize WFCP education program organizing enrollment, online sales, student experience, certifications, etc </li>\nProvide monthly digital marketing reports and insight/analytics </li>\nSupport in season campaigns including awards, design competition, </li>\nManage customer inquiries for subscribers providing excellent customer care written &amp; verbal</li>\nManage publication circulation and lists updating subscriber lists or accounts per request </li></ul> <br/>   MARKETING:   <br/> \n Support in the development and implementation of marketing strategies and campaign for both the company and its clients </li>\nOrganize, manage, design, and deploy email campaigns including sales campaigns, business newsletter, subscription promos, etc </li>\nSupport website updates including blogs, SEO optimization, manage website e-commerce store uploading new items, adjusting or improving existing items and copy</li></ul> <br/>   QUALIFICATIONS:   <br/> \nExperience with Office 365, Microsoft, CRM/Mailchimp, Excel, Powerpoint, Calendar, Zoom, Online Conferencing &amp; Remote Work Experience </li>\n3 - 5 year of digital marketing and administrative experience</li>\n3+ years of Woocommerce and/or WordPress</li>\n3+ years of Mailchimp experience or Mailchimp Academy certification ( a plus ) </li>\n3+ years of social media experience including Facebook, Instagram, LinkedIn &amp; Twitter</li>\nTroubleshooting skills, quick to resolve problems, and team player </li></ul> <br/>  This is a long-term commitment with an opportunity for growth. No agencies.   <br/>  <br/> </div>",
  "Plantation Golf and Country Club is looking to hire a Communication Director.<br/><br/> Essential Duties and Responsibilities include the following (other duties may be assigned):<br/> \nCoordinates communication with all department heads for accurate and timely submission of articles for the Club’s newsletter.</li>\nWrites, composes or edits club newsletter; collects, organizes and submits all copy for production in a timely manner; proofs contents for corrections and changes and responsible for the design and layout of pages.</li>\nWrites, composes or edits articles for the accounting statement mailing.</li>\nEstablishes and creates print materials for all aspects of the Club, including new member and prospective member promotional pieces, menus, athletic tournament entries, in house signage and special occasion amenities/materials, etc.</li>\nEnsures photos submitted for club marketing efforts are of the highest quality. Responsible for creating databases of club pictures for use in club displays across all departments. Takes pictures when necessary.</li>\nResponsible for all communication design, administration and editing tasks for the Club’s website. Areas include the Club home page highlights, blast emails (social, club dining and general club information), tending to member issues with accessing the site, adding/subtracting internal users and ensuring all areas are up to date with content.</li>\nThe Communications Director is responsible for making sure grammar and format are consistent across all club departments and facilitates corrections through appropriate communication.</li>\nCommunicates with club’s website company on future website enhancements or design features that will enhance club communications or marketing efforts.</li>\nIn conjunction with the Catering Office and/or Office, develops and prints menu cards, invitations, event flyers and other printed or electronic materials needed for events.</li>\nAssists the Human Resource Director with marketing of the Club to potential employment candidates.</li>\nDevelops short and long terms goals and communication plans for the department.</li>\nActively seeks innovative ways to improve the communication of information to members. Understands social media and the “App” movement in technology and how it can be effectively used within the Club’s culture.</li>\nKeeps informed of developments in the fields of marketing and communications.<br/><br/></li></ul> <u>Education And/or Experience<br/></u> \nFour year bachelor’s degree required. A degree in marketing or communications preferred.</li>\nTwo years related experience.</li>\nProficient with computers and software (Word, PowerPoint, Excel and Publisher with other graphics software knowledge desirable).</li>\nPrior website administration experience is preferred.</li>\nCandidate must have strong oral and written communication skills.</li>\nCandidate must have demonstrated skills, knowledge and experience in the design and execution of marketing and communication plans.</li>\nMust have experience with Facebook, Twitter, and Instagram.<br/><br/></li></ul> <u>Salary And Benefits<br/><br/></u> Salary commensurate with experience and qualifications. Full time non-management benefits package including vacation pay, 401K, health, dental and vision insurance, meals while on duty and golf privileges</div>",
  " If you’re the type of person who wants to shape the future of deep technology on Earth (and beyond!), build and grow startups around breakthrough tech, and operate highly complex programs - then we should talk.     FedTech is a venture builder. FedTech is a venture builder that thrives at the intersection of US entrepreneurship, breakthrough technologies, and mission-driven organizations. Since 2015, we have been driving forward deep tech ventures across the DoD, NASA, DoE, universities, and federal labs. Through our startup studios, accelerators, internal innovation, and corporate venture programs, we work with individuals, companies, and government agencies to stay at the bleeding edge of innovation. We are looking for an exceptional person to join our team.     We are looking for a standout candidate to join our growing team. The right candidate will bring a strong passion to understand our various programs and how we approach entrepreneurship training and new venture development. As an analyst, you will have the opportunity to work across various programs from inception which would include supporting program design, logistics and interfacing with inventors and entrepreneurs. You approach problems from the first principles, make data-driven decisions, and desire to evolve together with FedTech, a leader in the advanced technology entrepreneurship ecosystem.     What you will do: \nExecute massively complex workstreams including technology due diligence, program management, cross-program coordination, mentor programs, guest speakers, immersion experiences, and more.</li>\nInterface and support our program leads and clients - developing and sharing key metrics and narratives, and constantly learning about the federal innovation ecosystem.</li>\nDevelop, nurture, and grow relationships within our network organically.</li>\nBe able to absorb and communicate about complex topics in science, technology, entrepreneurship with polished business communication skills.</li>\nBuild strong relationships with industry experts, entrepreneurs, subject matter experts, and key stakeholders at partner organizations.</li>\nAssist with general resource needs such as content creation and curation.</li>\nEnjoy a creative and diverse work environment, where anyone is empowered to drive our strategy for how we solve problems.</li>\nParticipate in professional development activities like training, mentorship and networking. We are 100% committed to growing your skill-set.</li>\nAlmost anything else within reason -- we’re a startup!</li></ul>    About you: \nApproximately 1-3 years of experience working in a high-tech, high-paced environment; doing so in a deep-tech field or having a technical research background is a plus.</li>\nHave a strong desire to understand the underlying principles of science and technology. A degree in science or engineering is preferred.</li>\nLoves building strong relationships with a diverse set of people (e.g. scientist, corporate executive, entrepreneur, investor, government, etc.).</li>\nIncredible attention to detail and delivering on time.</li>\nTech-savvy. Expert in a handful of SaaS systems and interested in learning many more.</li>\nLoves working in a fast-paced and fluid environment.</li>\nDeeply curious, empathetic, and methodological.</li>\nMedium to expert level in Excel and other MS Office software. Must be tech-savvy.</li>\nRelentlessly biased towards action (testing, measuring, iterating).</li>\nHas a creative and rebellious streak with a desire to put your personal stamp on the company and the world.</li>\nDoesn't require much supervision while staying hyper-focused on the success of our portfolio companies. Extremely resourceful.</li></ul>    What we value: \nGrit: To have the courage, resolve, and intestinal fortitude to persevere in the face of uncertainty and failure.</li>\nConscientiousness: Someone who exhibits the following traits: goal-oriented, efficient, organized, hard-working, and reliable.</li>\nDiversity, equity, and inclusion: we recognize and actively value the equality of all people. We are always driving to reflect on, correct, and prevent the many barriers that remain for BIPOC, LGBTQ+, women, differently-abled, and many other groups/individuals.</li>\nSelf-Awareness: Without honest and frequent introspection, we cannot improve ourselves.</li>\nExecution: We are biased towards action, rapid learning, reflection and iteration.</li>\nIntegrity: Our reputation is everything to us. It takes years to build, but can be destroyed overnight if our moral compass ever wavers.</li>\nPeople: We treat our team members as we would like to be treated.</li>\nExtreme ownership: We take full responsibility for everything that goes wrong and share the glory when things go as intended.</li>\nNon-conformity: Because \"....that's how it's always been done\" is not an acceptable answer.</li></ul>     Location:  \nThis role is a full-time, salaried position with potential periodic travel both domestically and internationally (post-pandemic).</li>\nThis role will remain remote for the near future but may require you to periodically visit our office environment (DC area) and travel to client sites (post-pandemic).</li></ul>     Compensation:   Flexible. Analysts receive base, bonus, benefits and have the potential to earn equity and progress rapidly in our company. </div>",
  "  This is currently scheduled as a 90-day 40hr/wk contract role but there is definite long-term potential beyond that timeframe. Atlanta-based candidates or folks willing to relocate to Atlanta once COVID is behind us are preferred.<br/><br/>    *********<br/><br/>   If you are a mid/sr-level creative Copywriter with a broad portfolio and experience writing for social, then read on!<br/><br/>  We are looking for someone who is both conceptual and able to put pen to paper, with experience both dreaming up and producing content for social and digital channels.<br/><br/>  You will be working in tandem with an art director and designer to elevate a brand through social storytelling, both in small spaces (i.e., individual social posts) and via broader initiatives (things like a filmed content series).<br/><br/>  The initial focus will be on social (including both social posts and larger initiatives, like a filmed content series) for a healthcare client, but the extension would be into broader digital copy.<br/><br/><br/><br/>  Qualifications<br/><br/> \nBachelor's Degree in English, Journalism, Creative Writing, or Marketing would be great - feel free to substitute work experience or Portfolio Center/Creative Circus/etc.</li>\n3-5 years of professional copywriting experience, preferably at an advertising agency.</li>\nPrior experience writing for social campaigns.</li>\nExperience collaborating with a cross-functional team to develop best-in-class creative campaigns and messaging for clients. </li>\nPrior experience working directly with clients to review, deliver, and present work.</li>\nPrior experience working alongside the healthcare industry would be awesome but isn't a requirement.<br/><br/></li></ul> Additional Information<br/><br/>  As part of our dedication to an inclusive and diverse workforce, Sapient Corporation is committed to Equal Employment Opportunity without regard for race, color, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion. We are also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at hiring@publicissapient.com or you may call us at +1-617-621-0200. <br/><br/> </div>",
  "SEB is a leading Nordic financial services group with its headquarters in Sweden, present in 20 countries worldwide. We are a leading Scandinavian bank offering financial advice and a wide range of financial services, strongly focused on corporate and investment banking. In its 30 years of presence on the Polish market SEB has represented the unique combination of the Scandinavian way of doing business and local expertise.<br/><br/>Would you like to join? Our Financial Institutions Analysis unit is looking for:<br/><br/> Hedge Fund Analyst<br/><br/>  to join in our newly established Global Business Centre in Warsaw. <br/><br/> The role is central to SEB’s business process and credit risk management and will provide you with excellent opportunities to develop your credit analysis kills, and excellent opportunities for professional development and personal growth.<br/><br/> About The Job<br/><br/> Financial Institutions Analysis is a team within SEB’s Credit Analysis department providing SEB with state-of-the-art analysis of clients in support decision making in our credit business. We cover hedge funds, private equity funds, asset managers, broker dealer firms, central clearing counterparties and other non-banks financial institutions. As a Credit Analyst you will participate in the analysis of relevant financial institutions. This includes preparing and presenting recommendations to the various decision-making authorities within the bank. You will be expected to show flexibility and ability to quickly identify key credit risks in your assignments. As part of your work, you will interact with clients as well as internal stakeholders from business units or the credit organization. You need to stay well-informed of investment strategies, industry, market and regulatory developments. You will be expected to produce clearly written analyses and present these internally. You will be expected to take full responsibility for your analytical work.<br/><br/> Your profile<br/><br/> To be successful in this role we believe that you come with:<br/>\n an university degree, preferably in finance and engineering or mathematics, and</li>\n a relevant work experience (credit analysis, risk control/risk management function, treasury, trading operations or trading department).</li>\n interest in financial markets</li>\n experience in evaluating and understanding various financial risks such as market, credit and liquidity risk, as well as good knowledge of trading products.</li>\n prior experience from hedge funds and alternative trading strategies would be a plus.</li>\n an analytical personality, personal integrity and courage to speak your mind.</li>\n team player attitude but with ability to work independently</li>\n organizational skills, persistence and ability to work towards tight deadlines</li>\n keen eye for detail as well as a “big picture” perspective<br/></li></ul> Your Skills<br/> \n Fluency in English (C1/C2)</li>\n 0-3 years of relevant professional experience</li>\n Strong financial analysis skills and quantitative trading product knowledge</li>\n Experience of digital tools including advanced use of the MS Office (Excel, Word, Ppt)<br/></li></ul> Our offer<br/><br/> We strive to have an inclusive, friendly, value-driven culture where employees feel valued, respected and involved irrespective of who they are, what they believe or where they come from.<br/><br/>We are a stable employer. Our benefits include health insurance for you and your family, life insurance, individual pension found, sports package, trainings as well as top-notch office and great coffee.<br/><br/>Learn more about working at SEB www.sebgroup.com/career<br/><br/> Since our start 160 years ago, SEB has been guided by a strong belief that entrepreneurial thinkers combined with innovative companies are needed to create a better world. We are here to enable them to achieve their ambitions and succeed in both good and difficult times. We are the business engine of the bank, providing the financial expertise our organizational and private customers rely on. We do so with focus on our customers' needs, commitment to quality and trust, and an entrepreneurial mindset to continually improve our services. <br/><br/>  Read more: https://sebgroup.com/ </div>",
  " Brand Team - Project Manager<br/><br/>  <u>Who We Are<br/><br/></u> Founded in 1960, Fjällräven is a Swedish heritage brand, known for our outdoor clothing, bags, and equipment. Simplicity, durability and practicality are the foundation of our design principles, and a timeless aesthetic make our products life-long pieces that can be passed down through generations. With the utmost respect for our environmental footprint, we aim to be pioneers in sustainable apparel and outdoor equipment. Nature is, and always will be, our inspiration.<br/><br/> <u>About The Role<br/><br/></u> A member of the NA Fjällräven Brand Marketing Team. Fjällräven's NA Project manager is responsible for supporting and building the workflows and project management of content marketing and brand projects. . This role works with our key stakeholders and supporting teams to usher projects forward through kickoff to deployment to deliver on time and budget and in the most efficient way.<br/><br/>Communicates with internal, global teams , stakeholders and assigned agencies to achieve highest return on investment in projects.<br/><br/> <u>Role Deliverables &amp; Focus<br/></u> \nProject manages all marketing, content and brand project on time and budget with highest efficiency.</li>\nSuccessfully hosts briefing and intake sessions, communicates and plans for resources, monitors scheduling, trafficking timelines and deliverable with working team and key stakeholders.</li>\nStreamlines existing project processes and operations, introduces new processes and tools and uses global processes when appropriate for regional market. Applies systematic thinking ongoing.</li>\nManage and report back on ongoing assigned project budget needs/spends to key stakeholders with attention to detail and with clarity. Partners with finance for ongoing budget report.</li>\nTracks and communicates status of all projects to all stakeholders regularly and track stakeholder feedback.</li>\nOngoing management of internal and external vendors and agencies to facilitate highest return on investment and efficiencies per per project in annual plan and budget.</li>\nDetailed workback schedules of regional vs global content plans to maximize on global offer while being regionally relevant. Remove duplication of efforts.</li>\nSchedules and hosts all meetings related to marketing and creative projects partnering with VP brand, Director Marketing and content manager. Updates CEO and leads on progress.<br/></li></ul>Partners to build, support and celebrate resonating content, tools and team culture.<br/><br/> <u>Role Qualifications<br/></u> \n5+ years of professional experience in an agency, office, or fast-paced environments managing projects of marketing and content departments.</li>\nHighly skilled in the areas of process development, timelines, and playbooks. Proven ability in set up new processes and update existing processes to drive efficiency in project management.</li>\nEfficient in gathering intake, requirements, deliverables from key stakeholders (Brand, DTU, Wholesale) and successful planning of resource to deliver on time and budget.</li>\nSkilled collaborator. Works well with others with the ability to build trust with the team and work effectively in highly collaborative team environment.</li>\nMeticulously detail-oriented, analytical, resourceful, and obsessed with organization.</li>\nShown Communication excellence in verbal and written ongoing communication to team, stakeholders and global.</li>\nHigh tolerance for ambiguity with proven success in synthesizing and organizing complex information and programming it.</li>\nAmazing organizing and systematic thinking in approach to projects.</li>\nProficiency in tools such as wrike, Airtable, Mondays, basecamp, asana, google suite, Microsoft suite.</li>\nStrong budget negotiation skills and success in agency and vendor management.</li>\nProven track record of successful reporting of budget, capacities of department and delivery of projects on time and budget.</li>\nPassionate about nature, building premium brands and working with people.<br/></li></ul>Pay Range: $70,000-$80,000.<br/><br/>Bonus Structure: May be eligible for a discretionary bonus not to exceed $5,000 per year.<br/><br/>Benefits: Medical, Dental, Vision, 401k, generous PTO accrual and Holiday schedule.<br/><br/>SDL2019-64</div>",
  "\nPrior experience within financial services, banking or insurance is highly desired.</li>\nExcellent communication skills is a must.</li>\nOrganizational skills, attention to detail and excellent follow up skills.</li>\nExcellent interpersonal and client service skills. </li></ul>  </div>",
  " Conduct investigations and, bring to the appropriate criminal and civil justice systems, and administrative systems, those individuals and organizations involved in financial, professional, civil, or criminal misconduct relating to AmeriCorps programs and operations. </div>"
 ]
}